package com.icexxx.iceword;

import java.util.Random;

/**
 * 汉字处理工具类
 * 
 * @author IceWater
 * @version 1.0
 */
public class IceWordUtil {
    /**
     * 4096个常用汉字
     * 
     * @return 4096个常用汉字
     * @version 1.0
     */
    public static String word4096() {
        StringBuilder sb = new StringBuilder();
        sb.append("阿啊腌砹嫒暧锿霭艾哎哀埃挨唉爱隘碍矮蔼癌桉铵安岸按氨俺案庵暗鞍肮昂遨凹拗袄傲奥熬澳懊钯灞八巴叭扒芭坝把吧拔爸疤耙捌笆罢跋靶霸佰白");
        sb.append("百败柏拜掰摆钣办半扳扮伴绊拌板版颁班般斑搬瓣浜邦帮绑梆蚌谤棒傍榜膀磅孢趵煲包报苞抱饱宝保胞豹堡雹褒暴薄爆钡贝北狈卑杯备背倍被惫焙");
        sb.append("辈悲碑苯本奔笨泵崩绷蹦陛铋婢弼薜篦匕比币必毕闭庇彼秕荸毙笔逼蓖痹鄙碧蔽弊鼻壁避臂璧边贬变便扁匾遍编蝙辨辩辫鞭镖表标彪膘别憋瘪鳖斌");
        sb.append("殡宾彬缤滨濒鬓丙冰并兵秉柄饼病禀钵铂亳箔伯驳拨泊波勃玻剥舶菠脖跛渤博搏膊播簸钚卜不布步补怖哺捕部埠簿擦蔡才材财采菜彩猜裁睬踩璨灿");
        sb.append("参残蚕惭惨餐仓沧苍舱藏草曹槽糙操恻册厕侧测策层曾蹭猹叉杈岔刹衩茬茶查差插碴察拆豺柴谄谗婵禅蟾产掺阐铲搀馋缠蝉颤娼嫦厂长场肠昌畅尝");
        sb.append("倡猖常唱偿敞裳抄吵炒钞巢超朝嘲潮车扯彻澈撤臣尘忱辰沉陈衬晨趁丞骋成呈诚承城逞乘秤称程惩澄撑橙炽蚩尺斥弛吃池驰赤迟侈齿持耻翅匙嗤痴");
        sb.append("虫冲充宠崇瞅踌仇丑抽臭绸畴酬稠愁筹滁黜躇处出初除础畜厨锄储雏楚触橱矗踹揣舛氚川传串穿船喘创闯床疮窗幢吹垂炊捶锤纯春唇淳椿醇蠢绰戳");
        sb.append("此次伺词刺祠瓷赐辞慈雌磁从丛匆囱葱聪凑猝促粗醋簇蹿窜篡脆崔悴催粹摧翠寸存村挫措搓锉错撮嗒大打达搭答瘩殆傣黛歹代呆带贷待怠袋逮戴郸");
        sb.append("儋丹旦但担单诞胆耽掸淡蛋氮宕当挡荡档党铛裆氘刀叨导岛到捣倒祷盗悼道稻蹈的得德邓灯等登凳瞪蹬狄棣碲翟镝地低弟抵底帝涤敌递笛第蒂缔堤");
        sb.append("嘀嫡滴滇靛巅电佃甸典店玷垫点掂淀惦奠碘殿颠凋貂刁叼吊钓掉碉雕迭爹谍跌叠碟蝶丁订叮盯钉顶定鼎锭铥丢咚氡东冬动冻栋洞董懂窦斗抖豆陡蚪");
        sb.append("都逗兜痘笃渎椟犊妒杜肚毒独度读堵牍赌渡睹督镀煅段断短缎锻端怼队对兑堆炖礅吨盹钝盾顿敦墩蹲剁夺朵多垛哆舵堕惰跺躲踱峨娥鄂锇讹扼俄恶");
        sb.append("饿遏愕鹅蛾额噩鳄欸嗯恩铒二儿尔耳而贰饵垡乏发伐法罚阀筏钒梵璠藩凡反犯帆返饭泛矾范贩烦番樊繁翻钫方仿访防坊芳妨纺肪放房妃斐蜚翡镄霏");
        sb.append("飞吠非肺肥废沸费诽匪菲啡汾酚分份坟芬吩纷氛忿奋粉焚粪愤俸烽丰风凤冯讽枫奉封疯峰逢锋蜂缝佛否弗阜驸氟匐夫父付凫伏负妇芙甫扶抚附拂咐");
        sb.append("斧肤服府赴复俘俯浮麸脯袱副辅符赋幅傅富辐缚腹福孵腐敷蝠覆钆旮尬垓丐改该钙盖溉概尴赣干甘杆肝秆柑竿赶敢感橄冈刚肛杠岗纲钢缸港郜锆告");
        sb.append("羔高搞膏镐稿篙糕铬骼个戈各疙革阁格哥胳鸽蛤搁葛割隔歌给亘根跟庚赓更埂耿耕梗羹龚工弓公功巩共汞贡攻供拱宫蚣恭躬勾沟苟构购狗垢钩够轱");
        sb.append("钴锢古估谷咕沽固股孤姑故骨顾菇雇辜鼓箍瓜卦刮挂褂寡拐乖怪盥鹳关观官贯冠馆惯棺管灌罐胱广光逛皈癸晷归轨龟刽诡规柜闺贵鬼桂硅瑰跪衮辊");
        sb.append("棍滚掴聒蝈过果国郭锅裹铪哈氦嗨亥还骇孩海害瀚汉汗罕旱含函捍悍焊涵韩酣喊寒憨撼翰憾夯吭杭航昊郝皓号好耗浩毫蒿豪壕嚎劾涸阖禾合何呵和");
        sb.append("河贺荷核盒喝赫褐鹤黑嘿很狠恨痕亨恒哼横衡讧弘红宏轰哄虹洪烘鸿逅后吼侯厚候喉猴浒琥鹄互户乎沪护弧虎呼狐忽胡壶唬葫湖蝴糊化划华花画话");
        sb.append("哗桦猾滑坏怀徊淮槐桓獾幻欢环宦涣换唤焕患痪缓徨磺簧恍荒皇晃凰黄谎惶慌幌煌蝗蟥卉诙袆烩彗汇讳灰回会茴诲挥恢绘贿悔晦秽蛔惠辉毁慧徽昏");
        sb.append("荤浑混婚魂火伙或货活获祸惑霍豁伎屐姬悸蓟暨稷瘠羁几及己讥计叽击饥记吉圾机肌级纪妓技极即忌际鸡季剂荠挤急迹济既唧积脊疾继祭寂基寄绩");
        sb.append("棘集辑畸嫉箕稽鲫冀激籍镓甲加夹价佳驾荚枷架贾钾家假颊嫁嘉稼笺谏睑见尖件奸歼坚间拣肩建艰柬荐茧贱俭剑涧捡监健舰兼检减剪渐溅践鉴键简");
        sb.append("煎碱箭犟糨匠江讲降将奖姜桨浆蒋酱僵缰疆姣蛟跤醮叫交角侥郊狡饺浇娇骄绞轿较胶矫教脚窖搅椒焦剿酵蕉缴礁嚼桔婕藉介节阶芥戒劫杰届姐诫皆");
        sb.append("界洁结借秸捷接揭街解截竭妗烬巾仅斤今尽进近劲金津晋紧浸筋禁锦谨襟泾靓儆憬井阱茎径京净经荆竞竟惊颈敬晶景靖睛兢静境精鲸镜警炯窘九久");
        sb.append("旧纠臼玖鸠灸究疚韭酒救揪就舅狙飓巨句拒局炬沮驹拘具居矩举俱剧据菊距惧锯聚橘鞠狷娟卷捐倦绢眷鹃厥诀决觉绝倔掘爵郡军均君钧俊峻骏菌竣");
        sb.append("卡咖锎开凯揩慨楷侃刊坎砍看勘堪钪扛抗炕康慷糠考拷烤铐靠岢柯氪可壳克坷苛刻咳科客课棵渴颗磕蝌肯垦恳啃坑孔空恐控口扣抠寇骷库苦枯哭裤");
        sb.append("窟酷夸垮挎胯跨狯块快筷宽款旷狂况矿框眶筐奎睽亏盔傀溃葵愧魁窥锟鲲困坤昆捆扩括阔廓旯垃拉啦喇腊蜡辣涞铼来莱赖癞岚婪谰镧兰拦栏览烂揽");
        sb.append("缆榄蓝滥澜篮懒螂郎狼浪朗琅廊榔铑铹老劳牢姥唠烙捞涝酪潦了乐勒嘞磊镭肋泪类垒累雷擂蕾儡愣冷棱楞莅砺笠鹂锂力历厉立礼吏沥李丽励里利例");
        sb.append("隶荔俐厘莉砾哩栗狸离理梨犁粒雳痢漓璃鲤黎篱连怜帘练炼莲恋敛脸联链廉镰两良俩亮凉谅辆梁晾量粮粱钌辽疗料聊寥僚撩嘹缭燎瞭镣冽列劣咧烈");
        sb.append("猎裂拎粼霖麟吝邻林临赁淋琳凛檩磷鳞躏瓴聆羚另令伶灵岭玲凌铃陵菱蛉翎领零龄浏遛六刘柳留流琉硫馏溜榴瘤陇珑眬龙咙拢垄胧聋笼隆窿陋娄搂");
        sb.append("楼漏篓露禄潞璐鹭卢卤庐芦陆虏炉录赂颅鹿鲁碌路孪栾乱卵峦仑伦论抡沦轮捋漯罗洛络骆啰逻萝落裸锣箩骡螺吕驴侣律虑旅铝率绿氯缕屡滤履掠略");
        sb.append("马吗妈玛码蚂骂麻蟆霾迈买麦卖脉埋螨曼蛮满蔓幔馒漫慢瞒蟒芒忙盲茫莽卯牦蝥毛矛茂茅冒贸铆猫帽锚貌么莓嵋寐酶镁镅魅每没玫枚妹昧美眉梅媒");
        sb.append("媚楣煤霉钔焖门们闷氓孟萌梦猛锰蒙盟檬朦幂醚米觅泌弥咪迷秘眯密谜蜜糜靡渑腼免面勉娩眠冕绵缅棉喵邈妙苗庙秒描渺瞄藐咩灭蔑皿民闽悯敏冥");
        sb.append("名明鸣命铭螟谬嬷礳末茉陌抹沫莫馍寞摸漠摹模膜墨摩默磨蘑魔牟眸某谋苜钼木目母牡沐亩拇姆牧募睦墓幕慕暮穆镎那呐纳钠哪拿捺氖乃奶奈耐楠");
        sb.append("男南难囔囊瑙闹挠恼脑呢内馁嫩能妮铌霓尼拟你泥昵逆匿腻溺廿辇黏年念捻粘蔫撵碾娘酿鸟尿镍聂捏镊孽您佞宁拧狞泞柠凝妞牛扭纽钮农弄浓脓弩");
        sb.append("奴努怒暖娜挪诺懦糯钕女疟虐哦喔沤呕殴欧鸥偶藕琶帕爬怕趴拍派徘排湃牌磐判盼叛畔盘潘攀乓庞胖旁螃刨抛咆泡炮袍跑呸裴沛佩胚配陪培赔盆喷");
        sb.append("抨朋砰烹捧彭棚硼鹏蓬碰澎篷膨丕砒铍琵癖匹皮屁批坯披疲啤脾辟僻劈譬霹片偏骗翩篇嘌嫖票漂飘瓢氕撇嫔颦贫拼品聘频平乒评坪苹凭屏瓶萍钋珀");
        sb.append("鄱坡迫泼破颇婆魄剖匍濮曝仆扑朴圃浦菩葡铺普蒲谱瀑祁杞沏萋琪憩麒七乞气迄岂企齐弃汽启歧泣祈其奇妻契柒砌栖脐凄起畦崎戚骑期欺棋嘁旗漆");
        sb.append("器鳍洽恰掐仟阡虔倩堑千欠迁浅牵前钱钳铅乾嵌谦遣签歉谴潜黔羌襁呛抢枪腔强墙巧乔侨荞俏峭窍桥悄翘跷锹敲撬憔瞧妾锲切且怯茄窃沁芹钦侵亲");
        sb.append("秦琴禽寝勤擒氰磬罄庆青顷氢轻卿倾请清情晴蜻擎穷琼邱俅囚丘求秋蚯球蛐区去曲岖驱取屈娶蛆躯渠趋趣诠醛犬劝权全券泉拳痊圈阙却缺雀确鹊瘸");
        sb.append("裙群冉染然燃让攘壤嚷瓤娆扰饶绕热惹壬人刃仁认纫任韧忍仍扔日戎狨冗茸荣绒容蓉溶榕熔融肉柔揉蹂汝铷孺入如乳辱褥儒蠕阮软睿锐瑞蕊闰润若");
        sb.append("弱卅仨飒洒萨撒鳃腮塞赛三伞叁散丧桑嗓瘙扫搔骚嫂臊啬铯色涩瑟森僧裟鲨杀沙纱砂啥厦煞傻霎晒筛姗山闪杉删苫衫陕珊扇善擅膳赡熵上伤尚晌商");
        sb.append("赏杓邵勺少芍绍捎哨烧梢稍舌设社舍射涉赦奢赊蛇摄莘砷娠蜃什申伸身沈呻绅肾审甚神深渗婶慎升生圣声省牲胜笙盛绳甥剩仕铈十士尸氏矢示世石");
        sb.append("史失市式师时识虱势事侍使饰实试诗视始驶拭恃屎拾柿是适食狮蚀施室逝释湿嗜誓狩手守收寿受首授售兽瘦戍孰塾书术抒束枢述叔树竖秫恕殊庶淑");
        sb.append("梳赎黍暑舒属疏署蜀输鼠数墅漱蔬熟薯曙刷耍帅甩衰摔蟀拴栓涮孀双爽霜水谁税睡舜吮顺瞬朔烁说硕驷嗣厮锶四司丝寺死似私饲思斯肆嘶撕怂凇淞");
        sb.append("嵩讼宋松送诵耸颂叟馊擞搜嗽艘苏诉肃俗素速宿粟酥溯塑蒜酸算绥隋岁虽祟随遂碎隧穗髓狲孙损笋莎蓑所唆索琐梭锁嗦缩沓铊他它她塔塌踏蹋钛酞");
        sb.append("跆太台汰苔抬态胎泰忐钽叹坛昙坦贪炭袒谈探弹毯摊痰滩碳谭瘫潭檀螳汤倘唐烫淌堂棠搪塘趟躺膛糖啕讨逃桃套涛陶掏萄淘滔忑特疼誊腾藤锑体屉");
        sb.append("剃剔涕梯惕啼替提题踢蹄腆天田恬甜添填舔迢眺窕条挑调笤跳帖贴铁烃婷厅廷听挺亭庭停蜓艇砼同彤统捅桐通桶铜筒痛童瞳头投透偷钍土凸吐秃图");
        sb.append("兔突徒途涂屠湍团退推蜕颓腿褪饨屯囤吞臀驮托妥拓拖驼鸵唾脱椭娲瓦洼挖娃袜蛙外歪烷皖万丸完宛玩弯顽挽惋婉晚腕湾碗豌罔亡王网妄忘汪枉旺");
        sb.append("往望韦诿逶潍卫为未伟伪危苇纬违围位尾味委威畏胃桅萎偎谓尉唯维猬喂微蔚慰薇魏巍刎汶雯文问吻纹闻紊蚊温瘟稳瓮翁嗡倭我沃卧涡握窝蜗毋戊");
        sb.append("邬吾钨婺无五午勿乌务伍污坞芜巫吴呜武物诬侮误屋捂悟梧晤鹉蜈雾舞兮奚玺硒淅蜥樨羲曦夕习西吸戏希系昔析细洗牺息席徙袭悉惜晰犀喜稀隙媳");
        sb.append("锡溪熙熄嬉膝蟋遐瑕下吓匣侠虾峡狭夏暇辖瞎霞氙藓仙先纤县闲现贤弦限线涎咸显宪险陷铣舷掀衔馅羡锨腺献嫌鲜饷襄乡向享详项巷相响香祥厢象");
        sb.append("翔湘想像橡箱镶逍筱霄小肖孝削哮校晓笑效消宵萧啸淆硝销箫嚣偕亵写协邪血些胁泄泻挟卸屑谐械斜谢楔携歇蝎鞋懈蟹忻馨鑫心芯辛欣信衅锌新薪");
        sb.append("荥钘惺邢刑行兴形杏幸性姓型星猩腥醒凶兄匈汹胸雄熊貅朽休秀修羞袖绣锈嗅戌胥栩墟嘘吁旭许序恤须叙徐酗虚绪续婿絮蓄需眩玄轩炫选宣悬旋喧");
        sb.append("漩癣穴学雪靴薛峋薰醺训讯汛驯旬寻迅巡询勋逊殉循熏娅氩牙轧讶亚压芽呀押鸦哑蚜鸭涯崖雅衙妍俨彦焉偃焱湮赝厌延严言奄岩炎沿砚衍研咽唁艳");
        sb.append("盐烟宴验阎谚掩眼淹堰蜒雁焰演颜燕檐佯恙央扬仰羊阳杨殃养洋鸯样氧秧痒漾幺尧杳窈瑶夭吆妖肴姚药要咬舀窑谣摇遥腰邀耀耶也业叶页爷冶夜掖");
        sb.append("谒野液椰腋钇佚矣怡祎诣驿贻弈羿铱翌颐蜴熠镱彝一乙亿义已艺忆以仪议夷屹伊亦衣异抑邑医役译绎易依宜奕蚁疫姨胰倚益谊逸移揖壹椅遗肄溢意");
        sb.append("疑毅翼尹胤铟寅引印因阴吟饮茵音姻蚓殷淫银隐瘾颍楹迎应英荧映盈莹莺萤婴营硬颖缨蝇樱影鹦赢鹰哟雍壅用永佣拥咏泳勇涌庸蛹踊酉攸柚莜铀铕");
        sb.append("釉鱿又尤友右由幼有优佑邮犹忧油幽诱悠游妤盂竽禹俞钰渝瑜虞煜于与予玉迂芋屿宇羽余郁雨鱼育狱语浴娱预淤隅域欲渔喻逾寓遇御愉裕榆愚愈誉");
        sb.append("舆豫苑媛螈元远园员怨院袁鸳原圆冤渊援缘猿源辕愿曰月约岳钥阅悦跃粤越殒熨云匀允孕运陨耘晕酝韵蕴匝扎杂砸哉崽再在灾栽载宰咱暂赞攒奘臧");
        sb.append("赃脏葬早皂灶枣蚤造凿遭噪澡糟燥藻躁仄则责择泽贼怎憎增赠札蚱楂乍诈闸栅眨炸铡喳渣榨宅斋债窄摘寨詹辗占斩沾栈毡战盏站展绽崭瞻蘸漳璋蟑");
        sb.append("丈仗杖帐张账胀涨章掌障彰樟诏肇爪召兆找沼招昭赵照罩柘蛰蜇谪褶折这者哲浙蔗遮辙圳帧鸩桢朕赈甄贞阵针诊枕侦珍疹振真斟榛震镇峥正争证怔");
        sb.append("征郑拯狰政挣症睁筝蒸整炙枳轵峙咫陟雉之支止只汁执芝至旨吱址志纸直枝帜制知侄质肢治织指挚致秩值脂掷趾窒职滞植殖智稚置蜘中仲众忠肿终");
        sb.append("盅钟种重衷舟州肘咒帚周宙轴洲昼皱粥骤竺褚瞩主朱竹助住拄贮注驻柱祝珠株逐烛诸蛀猪煮蛛铸筑嘱抓拽篆专转砖赚撰妆壮庄状桩装撞坠追缀椎锥");
        sb.append("赘谆准镯灼拙茁卓浊酌捉桌著啄着琢兹渍淄子仔自字姊咨籽姿资紫滋滓粽鬃纵宗总综棕踪邹走奏揍诅足阻卒组祖租族钻最罪醉嘴尊遵左作坐昨座做");
        return sb.toString();
    }

    /**
     * 按音序排列的汉字
     * 
     * @return 汉字音序排序表
     * @version 1.0
     */
    public static String pinyin() {
        StringBuilder sb = new StringBuilder();
        sb.append("阿啊锕腌艾毐哎哀埃挨砹唉爱皑隘碍嗳矮嫒蔼暧锿癌霭安岸按桉氨俺胺案埯铵庵谙揞鹌暗鞍盦黯昂肮盎凹岙");
        sb.append("坳拗袄敖傲奥媪遨骜嗷廒璈獒熬澳懊聱螯翱鏊鳌鏖八巴扒叭坝把芭吧拔爸钯疤耙捌罢笆粑菝跋鲃靶鲅魃霸灞");
        sb.append("白百败佰柏拜捭掰摆稗办半阪扳坂扮伴拌板版绊钣班舨般颁斑搬靽瘢癍瓣邦帮绑梆蚌浜棒傍谤搒蒡榜膀磅镑");
        sb.append("包报抱苞饱宝孢保胞鸨趵豹葆堡雹龅煲鲍褓暴褒薄爆贝北孛邶呗狈陂杯卑备背钡倍悖被庳椑辈悲惫焙蓓碑碚");
        sb.append("鹎鞁褙鞴鐾本坌苯奔栟畚笨锛甭泵迸崩绷琫嘣甏镚蹦匕比币必毕闭庇沘诐妣畀彼贲荜毖哔秕陛荸毙铋笔俾狴");
        sb.append("敝婢逼赑筚愎弼蓖睥鄙跸痹滗碧蔽箅鼻弊薜觱篦壁避嬖髀鲾濞臂璧襞卞边弁抃苄汴忭贬变砭便扁匾笾遍缏编");
        sb.append("煸碥褊蝙辨辩鳊辫鞭表标飑俵彪婊裱摽骠膘飙镖瘭瀌鳔镳别瘪憋蹩鳖玢宾彬傧斌摈滨缤槟殡膑镔濒豳髌鬓丙");
        sb.append("冰并邴兵秉柄饼炳病摒禀伯驳拨帛泊波玻勃钵钹铂饽亳浡袯剥菠啵舶脖博鹁跛渤搏鲌僰箔膊播踣嶓镈檗擘簸");
        sb.append("礴卜不布卟步补怖钚捕逋哺部埠晡瓿醭簿擦嚓礤才材财采菜偲彩猜裁睬蔡踩灿参残蚕惭惨骖粲餐璨仓伧苍沧");
        sb.append("舱藏草曹嘈漕槽操糙螬艚册厕侧测恻策岑涔层曾噌蹭叉汊杈岔刹衩诧垞茬茶查差姹搽插嵖猹馇槎碴锸察蹅檫");
        sb.append("镲拆钗侪虿茝柴豺瘥产忏觇浐谄掺铲阐谗婵搀蒇馋禅孱缠蝉廛潺骣澶冁瀍蟾颤巉羼韂躔镵厂长场伥玚苌肠怅");
        sb.append("昌畅尝昶倡鬯菖常唱偿徜猖阊惝娼敞裳嫦氅鲳抄吵炒怊钞耖晁巢超朝嘲潮车扯彻坼砗掣撤澈臣尘辰沉忱陈抻");
        sb.append("衬疢郴龀宸晨谌琛趁榇碜嗔谶成丞呈枨诚承城柽宬琤埕逞乘秤称骋蛏牚程惩裎赪塍酲撑澄橙瞠彳尺叱斥吃池");
        sb.append("弛驰赤饬迟茌齿侈持炽耻翅哧鸱蚩敕豉匙眵笞瓻啻嗤痴媸墀踟瘛褫螭篪魑虫冲充忡宠舂崇铳憧艟仇丑抽俦帱");
        sb.append("臭惆绸畴酬稠愁筹瞅踌瘳雠犨亍处刍出初杵怵绌除础俶畜楮厨锄储滁搐楚蜍触雏樗橱憷黜躇蹰矗揣搋踹膪川");
        sb.append("传舛串氚钏穿船喘遄椽创闯床怆疮窗幢吹垂炊陲捶棰槌锤纯春莼唇淳椿鹑醇蝽蠢啜绰辍龊踔戳此次伺词刺茨");
        sb.append("泚祠瓷疵赐跐辞慈磁雌鹚糍从丛匆苁囱枞淙琮葱骢璁聪熜凑辏腠徂殂促猝粗蔟醋簇蹙蹴汆窜撺篡镩蹿爨脆萃");
        sb.append("啐崔淬悴毳催瘁摧粹翠璀寸存忖村皴挫厝措脞搓嵯锉矬痤错磋撮蹉大打达怛妲垯荙耷炟笪搭嗒答跶靼瘩褡鞑");
        sb.append("歹代轪呆呔甙岱迨玳带殆贷待怠埭袋逮傣戴黛丹旦但担单诞眈胆耽疸郸疍掸聃萏啖淡惮蛋殚氮亶瘅箪儋澹当");
        sb.append("凼砀宕垱挡荡珰档党菪铛裆筜谠刀叨忉氘导岛到捣倒鱽焘捯盗悼祷道稻蹈纛的得锝嘚德邓灯等登戥凳噔嶝磴");
        sb.append("瞪镫簦蹬氐地低邸狄弟诋抵坻迪籴底柢帝荻砥敌递涤娣菂笛第羝谛堤蒂棣觌睇缔碲嘀骶滴嫡翟踶镝蹢嗲电佃");
        sb.append("甸阽坫典店玷垫点钿掂淀惦奠碘滇殿踮靛颠簟癜巅癫刁叼汈吊钓凋掉铞铫貂碉雕鲷迭垤瓞爹谍堞耋喋跌牒叠");
        sb.append("碟蝶蹀鲽丁仃订叮玎盯钉疔顶耵定酊啶鼎腚碇锭丢铥东冬动冻咚侗垌栋氡胨洞恫鸫胴硐董懂斗抖豆钭陡都逗");
        sb.append("蚪兜痘窦蔸篼芏厾杜肚妒毒笃独度读堵阇渎椟赌犊牍渡督睹嘟镀黩髑蠹段断短缎椴煅锻端簖队对兑怼堆碓憝");
        sb.append("镦吨沌炖砘盹钝盾顿趸惇遁敦墩礅蹾蹲夺朵多咄剁饳垛哚哆铎剟掇舵堕惰跺躲裰踱亸厄讹扼苊呃轭垩俄莪恶");
        sb.append("峨饿娥婀鄂阏谔萼遏锇鹅愕蛾腭鹗锷颚额噩鳄欸恩摁蒽嗯二儿尔耳而佴迩贰饵洱珥鸸铒乏发伐法珐罚垡阀砝");
        sb.append("筏凡反犯帆返饭泛范矾贩钒畈烦梵番墦蕃樊幡璠燔繁藩翻蹯蘩方仿邡访防坊芳妨纺枋昉肪放房钫舫鲂飞妃芾");
        sb.append("吠非肺肥狒废沸费匪剕诽菲啡淝悱绯斐腓扉痱榧蜚翡镄霏篚鲱分份坟芬吩汾纷奋氛忿粉棻酚偾棼焚粪愤鼢鲼");
        sb.append("瀵丰风凤冯讽沣沨奉枫封砜疯峰俸逢唪烽葑锋蜂缝酆佛缶否夫父讣付弗伏负凫妇扶抚芙甫呋孚附拊拂苻茀咐");
        sb.append("阜斧肤服府怫绂驸绋韨赴茯罘氟复俘郛洑祓莩蚨俯釜浮麸菔桴副辅趺符脯匐涪袱艴跗幅赋稃傅腑富辐蜉腹鲋");
        sb.append("滏福缚赙孵腐敷蝠蝮幞黻鳆覆馥簠黼尕钆旮尬尜嘎噶丐改该陔垓钙赅盖溉概干甘玕杆旰肝坩苷矸秆泔绀柑竿");
        sb.append("赶酐疳淦敢感尴澉橄擀鳡赣冈刚杠岗肛纲钢缸罡港筻戆告杲郜诰皋高羔锆搞缟槔槁睾膏镐稿篙糕藁个戈圪各");
        sb.append("疙革虼饹阁格哥鬲胳哿铬舸鸽袼搁葛蛤割隔塥嗝歌膈骼镉给亘艮茛哏根跟更庚耕埂耿哽绠梗赓鲠羹工弓公功");
        sb.append("巩共汞贡攻供肱拱宫珙恭唝蚣躬龚觥勾佝沟苟构岣购狗诟垢枸钩笱够缑遘彀媾觏篝鞲古估谷汩诂咕固股沽孤");
        sb.append("姑故轱骨牯鸪顾罟钴堌菰菇梏蛄蛊崮蓇辜酤觚馉雇鼓毂锢痼榖嘏鹘箍鲴臌瞽瓜卦刮诖挂剐胍栝鸹褂寡夬拐乖");
        sb.append("怪关观官贯冠倌掼馆涫惯琯棺祼管盥鳏灌瓘鹳鳤罐广光犷咣桄胱逛归宄圭轨龟庋妫规匦邽柜矽刿刽诡贵皈鬼");
        sb.append("闺姽癸桂桧硅眭晷瑰跪鲑簋鬹鳜衮绲棍辊滚磙鲧过果国埚郭掴帼崞馃聒椁锅蜾蝈裹虢馘哈铪亥还孩骇氦胲海");
        sb.append("害嗨骸醢邗汉犴汗邯旱含罕函顸捍悍菡晗蚶焊焓涵韩酣喊寒颔撖憨撼翰憾鼾瀚夯吭沆杭绗航颃号好昊郝耗蚝");
        sb.append("浩毫淏皓蒿嗥豪薅嚆壕嚎濠颢灏禾合纥何诃呵和劾河曷饸阂贺盍荷核盉菏龁盒涸喝颌嗬貉阖赫褐鹤翮翯壑鞨");
        sb.append("黑嘿很狠恨痕亨恒珩桁哼鸻横衡蘅讧弘红闳宏轰泓荭哄虹訇竑洪烘鸿葓蕻薨黉后吼郈厚侯逅候堠喉猴鲎瘊骺");
        sb.append("篌糇齁互户乎冱护囫沪虎呼岵狐忽怙戽弧胡轷烀浒祜壶笏瓠唬唿斛惚扈琥葫鹄猢湖瑚煳鹕滹槲蝴糊醐觳鹱化");
        sb.append("划华花画话哗骅桦铧婳猾滑坏怀徊淮槐踝耲幻欢奂环洹宦换桓唤涣浣萑患焕逭痪缓豢锾漶鲩擐圜澴寰缳鹮獾");
        sb.append("鬟肓荒皇恍晃黄凰谎隍塃喤遑徨湟慌惶幌煌锽潢璜蝗篁磺癀蟥簧鳇卉汇灰回会讳诙挥茴荟虺咴洄恢袆诲绘恚");
        sb.append("晖贿烩悔彗晦秽惠辉蛔喙翙翚睢毁慧蕙麾徽隳蟪昏诨荤浑珲馄阍混婚魂溷火伙或货钬活获祸耠惑锪夥劐霍嚄");
        sb.append("豁镬攉藿嚯蠖几及己计讥击叽伋饥记玑吉圾芨机乩岌伎肌汲级纪技芰极矶即忌际妓鸡虮季佶剂亟垍挤荠咭笈");
        sb.append("急迹洎济既姞剞唧觊积笄脊疾屐姬继掎基偈鱾祭悸寄寂绩戟赍棘殛戢犄嵇集塈缉蓟蒺楫辑畸跻嵴麂嫉霁跽箕");
        sb.append("鲚暨蕺稽稷鲫瘠齑鹡畿髻墼冀穄激蹐羁罽檵骥籍甲加夹价伽郏岬佳迦驾珈荚枷胛浃架恝贾钾痂家戛铗笳假袈");
        sb.append("葭颊跏蛱斝嫁嘉槚镓稼见戋尖囝件奸歼坚间拣枧饯肩建艰荐茧柬贱牮俭剑捡监笕健舰兼涧菅检趼笺减剪渐谏");
        sb.append("楗硷睑践锏毽犍腱溅湔裥缄搛蒹鉴键简煎谫缣戬槛碱僭踺箭鲣翦鹣蹇謇鞯匠江讲降茳将奖姜洚绛豇桨浆蒋酱");
        sb.append("僵耩膙犟缰鳉礓糨疆艽叫交角侥佼郊挢茭峧狡饺浇娇姣骄绞轿较胶教铰矫皎脚搅椒蛟焦窖跤敫滘剿酵僬鲛蕉");
        sb.append("噍徼缴礁鹪藠醮嚼孑介节讦阶戒劫芥疖玠杰诘届姐拮皆界疥洁诫结桔蚧借桀捷接秸婕颉揭喈嗟街湝睫解截碣");
        sb.append("竭羯藉巾仅斤今尽进近妗劲金卺荩津浕衿矜晋紧赆烬浸琎堇祲筋靳禁锦谨缙馑瑾觐槿殣噤襟井阱刭茎径肼京");
        sb.append("净泾经荆胫痉竞菁猄竟旌惊婧颈靓敬晶景腈睛靖粳静境兢儆獍精憬璟镜鲸警鼱炅迥炯扃窘九久旧纠臼玖鸠灸");
        sb.append("究咎疚赳柩韭桕阄酒救厩揪啾就舅僦鹫鬏巨句讵拒苣局拘苴具咀狙炬沮泃居驹莒矩举俱倨疽剧掬据菊距惧琚");
        sb.append("椐锔犋腒飓湨蒟榉龃雎锯裾聚窭踞屦橘遽踽鞠鞫醵卷捐倦狷桊涓娟绢鄄脧眷棬鹃锩镌蠲孓决诀抉玦珏觉绝倔");
        sb.append("掘桷崛觖厥劂谲撅蕨獗橛噱镢爵蹶矍爝攫军均君钧俊郡捃莙峻隽浚骏菌皲畯竣鲪麇卡咔咖咯胩喀开忾剀凯垲");
        sb.append("闿恺铠揩蒈锎慨楷锴刊坎侃砍看莰勘龛堪戡墈阚瞰亢扛伉抗闶炕钪康慷糠尻考拷栲烤铐犒靠可壳克坷苛岢刻");
        sb.append("珂柯轲咳科恪客牁疴课屙氪骒棵颏渴缂嗑锞稞溘窠颗磕瞌蝌髁肯垦恳啃裉坑硁铿孔空恐倥控崆箜口叩扣抠眍");
        sb.append("寇筘蔻库苦矻刳枯绔哭喾裤窟酷骷夸侉垮挎胯跨块快侩郐哙狯浍脍蒯筷鲙宽款髋邝匡圹夼纩旷狂况矿诓哐贶");
        sb.append("诳框眶筐亏岿奎悝逵匮盔傀馗揆蒉葵喹喟馈溃愦愧骙暌跬魁窥睽聩蝰篑夔困坤昆捆阃悃裈琨焜髡锟醌鲲扩括");
        sb.append("蛞阔廓旯垃拉剌啦喇腊蜡瘌辣鞡邋镴来莱崃徕涞梾赉睐铼赖濑癞籁兰岚拦栏览烂婪啉揽阑缆蓝榄滥罱漤谰澜");
        sb.append("褴篮斓懒镧襕郎莨狼阆浪朗琅啷廊烺榔锒稂蒗螂老劳牢佬姥捞栳唠崂烙涝铑铹痨耢酪嫪潦醪了仂叻乐泐勒鳓");
        sb.append("耒肋泪诔类垒累雷酹嘞嫘缧磊擂蕾檑儡礌镭羸冷塄棱愣楞力历厉立礼吏坜苈李丽励里呖利沥枥例疠戾隶荔栎");
        sb.append("郦厘轹俪俚俐疬莉莅栗逦砺砾哩狸猁离娌骊理蛎唳梨犁笠粝粒鹂雳喱跞詈锂傈痢蓠蜊溧漓缡璃嫠黎鲡鲤罹篥");
        sb.append("篱澧藜醴黧鳢蠡奁连怜帘练炼莲恋涟琏殓敛脸联链裢裣楝廉蔹潋鲢濂臁镰蠊两良俩亮倞凉悢谅辆梁椋辌量晾");
        sb.append("粮粱踉魉辽尥钌疗料聊撂蓼僚廖寥撩嘹獠寮缭燎鹩瞭镣蹽列劣冽咧洌埒烈捩猎裂趔躐鬣邻吝拎林临赁淋琳蔺");
        sb.append("粼嶙凛遴璘霖辚膦廪檩磷瞵鳞躏麟另令伶灵苓呤岭囹泠玲柃瓴铃鸰凌陵聆菱棂蛉领翎羚绫祾零龄鲮酃六刘柳");
        sb.append("浏留流琉绺硫遛馏旒溜骝榴飗熘镏鹠瘤镠鹨蹓鎏龙陇垅拢茏垄咙泷珑栊昽胧砻眬聋笼隆癃窿陋剅娄搂蒌喽嵝");
        sb.append("溇楼镂瘘漏耧蝼篓髅露卢甪芦卤庐陆垆虏炉泸录栌轳胪辂鸬赂掳颅舻鹿渌逯鲁禄碌路僇鲈箓漉撸辘噜戮橹氇");
        sb.append("潞璐镥簏鹭麓乱卵峦孪娈栾挛鸾脔滦銮仑伦论抡囵沦纶轮罗泺荦洛络骆珞捋萝硌啰逻脶猡落椤锣裸摞箩雒漯");
        sb.append("骡瘰螺蠃吕驴侣律闾虑旅铝稆偻率绿氯屡缕榈滤膂褛履掠略锊马吗犸妈玛祃码蚂骂麻嘛蟆劢迈买麦卖荬脉埋");
        sb.append("唛霾曼蛮满谩墁蔓幔馒漫慢嫚缦瞒颟螨镘鳗邙芒忙杧盲茫莽硭漭蟒毛卯矛芼茂茆茅峁牦泖眊冒昴贸耄铆旄猫");
        sb.append("袤帽瑁锚髦貌瞀蝥懋蟊么麽每没玫枚妹昧美袂眉莓浼梅郿嵋猸湄寐媒媚楣煤酶镁镅魅鹛霉门们扪闷钔焖懑氓");
        sb.append("孟虻勐萌梦猛蒙盟锰甍蜢艋瞢幪獴檬朦鹲礞懵蠓艨米芈汨觅泌宓弥咪迷洣祢弭秘脒敉眯猕密谜幂谧嘧蜜醚糜");
        sb.append("縻麋靡蘼醾免沔面眄勉眠娩冕渑绵棉湎缅腼妙苗杪庙眇秒描喵渺缈鹋瞄藐邈乜灭咩蔑篾皿民闵抿苠旻黾岷泯");
        sb.append("珉闽悯敏缗鳘名明鸣命茗洺冥铭蓂酩溟暝瞑螟谬末抹茉殁沫陌莫秣谟摸蓦貊馍漠寞嫫靺摹模膜墨镆摩瘼默磨");
        sb.append("貘嬷蘑魔礳耱牟侔某哞眸谋蛑缪鍪木目仫母牡亩沐拇苜牧姆钼毪募墓幕睦慕暮穆那呐纳肭哪钠衲拿捺镎乃艿");
        sb.append("奶氖奈柰耐萘鼐囡男南难赧喃楠腩蝻曩囊攮囔馕齉呶闹挠恼孬脑硇铙淖蛲猱瑙臑讷呢内馁恁嫩能尼拟你坭泥");
        sb.append("怩妮昵逆匿铌倪猊旎睨腻溺霓鲵廿年拈念捻埝粘辇鲇蔫撵碾黏娘酿鸟尿茑袅脲陧捏聂臬涅啮嗫镊镍颞蹑孽蘖");
        sb.append("糵您宁佞拧咛狞泞柠聍凝牛扭狃忸妞纽杻钮农弄侬哝浓脓秾耨奴努帑弩孥驽怒砮胬暖挪娜诺喏傩搦锘懦糯女");
        sb.append("钕恧衄疟虐哦喔噢讴呕沤怄瓯欧殴鸥偶耦藕杷帕爬怕趴啪琶葩筢拍呱哌派俳排徘蒎牌湃爿判泮柈盼叛畔袢盘");
        sb.append("磐潘蹒蟠攀襻乓彷庞胖逄旁滂耪螃鳑抛刨咆狍庖泡炮疱袍匏脬跑沛呸帔佩胚配旆陪培赔锫辔裴醅霈盆喷抨朋");
        sb.append("怦砰捧堋烹彭棚蓬硼碰鹏嘭澎篷膨蟛匹丕庀皮圮仳批邳吡伾屁纰坯披枇狉砒毗蚍铍郫疲陴啤淠琵脾痞鲏裨辟");
        sb.append("媲蜱罴僻劈噼澼貔甓癖譬鼙霹片骈胼偏谝骗犏篇翩蹁票殍剽嘌漂嫖缥飘瓢瞟螵氕苤撇瞥牝拚贫拼品姘聘榀频");
        sb.append("嫔颦平乒评坪苹凭枰帡俜洴屏瓶娉萍鲆叵钋坡迫泼珀破钷笸粕婆颇酦魄鄱皤抔剖掊裒仆扑朴匍埔莆圃浦菩葡");
        sb.append("铺普蒲溥谱噗潽璞氆镤镨濮瀑曝蹼七乞亓气讫芑岂屺迄企齐汔祁圻芪杞岐弃沏汽启其奇妻歧泣祈契砌柒起耆");
        sb.append("栖桤颀脐凄埼萁萋戚畦崎淇骐骑绮琪琦期欺葺棋蛴棨祺碛锜綦碶嘁蜞旗漆蕲槭器憩鲯蹊鳍麒拤洽恰掐葜髂千");
        sb.append("欠仟阡扦芊迁芡岍佥钎肷浅茜荨牵钤前虔钱钳铅倩悭掮乾堑椠嵌谦遣签愆鹐慊骞歉搴潜谴黔褰缱抢呛羌枪戗");
        sb.append("炝戕跄羟腔强蜣锖墙蔷锵嫱樯镪襁巧乔侨荞峤俏诮桥峭悄窍硗硚翘愀跷锹劁敲谯撬鞒憔鞘橇樵缲瞧切且茄郄");
        sb.append("妾怯窃挈惬趄锲箧芹芩吣沁钦侵亲秦衾骎琴揿嵚锓禽勤嗪寝擒噙檎庆青苘顷轻氢倾卿勍请圊庼清情晴氰蜻箐");
        sb.append("綮磬檠擎鲭罄黥邛穷茕穹筇琼蛩銎囚丘犰求虬邱泅秋俅訄酋逑球蚯赇萩遒湫巯楸裘璆蝤糗鳅鞧区去曲岖劬诎");
        sb.append("驱取屈朐祛鸲袪娶蛆躯焌渠趋蛐阒蕖趣觑磲璩龋瞿鼩蘧黢氍癯衢蠼犬劝权全券诠荃畎泉辁拳悛圈铨痊绻筌蜷");
        sb.append("醛鳈鬈颧却炔卻缺悫雀确阕鹊阙榷瘸逡裙群冉苒染蚺然髯燃让壤攘蘘嚷禳穰瓤扰荛饶娆绕桡热惹人刃壬仁认");
        sb.append("仞任纫韧轫饪妊忍纴荏衽稔仍扔日冗戎茸荣狨绒容嵘蓉溶瑢榕熔镕蝾融肉柔揉糅蹂鞣入汝如乳茹洳辱铷蓐溽");
        sb.append("缛褥儒薷嚅濡孺襦颥蠕阮软朊芮汭枘蚋锐瑞睿蕤蕊闰润若偌弱箬卅仨飒洒脎萨靸撒腮塞赛噻鳃三伞叁散毵糁");
        sb.append("馓潵丧桑搡嗓磉颡扫埽搔嫂骚瘙缫臊色涩啬铯瑟穑森僧杀沙纱砂啥唼铩厦痧嗄歃傻煞裟鲨霎晒筛山闪讪汕芟");
        sb.append("杉删苫钐疝衫陕姗珊舢扇跚善骟鄯煽潸缮擅膳嬗赡膻蟮鳝上伤尚垧殇晌商赏觞墒熵勺少芍杓邵劭绍捎哨烧梢");
        sb.append("稍筲艄韶潲厍舌设佘社舍射涉赦奢蛇赊猞畲摄滠慑麝什申伸身沈肾呻审诜绅甚哂矧胂神莘砷谂娠深渗婶葚蜃");
        sb.append("瘆慎鲹燊升生圣声省牲胜晟眚盛笙绳甥剩嵊十士尸氏示世石史失矢仕市式师豕时识势事侍使饰实试诗视鸤始");
        sb.append("虱驶拭拾贳柿是适食狮蚀施炻浉恃室屎埘逝莳轼铈舐弑释湜湿谥蓍嗜筮誓酾奭鲥噬鲺螫鼫手守收寿受狩首授");
        sb.append("售兽绶瘦殳书术戍抒束纾枢述叔沭树竖姝殊秫倏恕菽梳孰庶淑暑赎黍舒属疏摅输署蜀鼠毹腧数墅塾漱蔬熟澍");
        sb.append("薯曙刷耍帅甩衰摔蟀闩拴栓涮双爽霜孀水谁税睡吮顺舜楯瞬妁烁说铄朔硕搠蒴槊巳四司丝寺死似汜兕私祀姒");
        sb.append("咝饲泗驷思俟涘鸶耜笥斯蛳缌肆嗣飔厮锶撕嘶澌讼忪宋松怂送诵耸颂凇悚菘淞竦嵩叟搜嗖馊廋溲飕瞍嗽嗾螋");
        sb.append("艘擞薮夙苏诉肃俗素速涑宿粟酥谡嗉稣塑溯愫窣蔌僳觫簌蹜狻蒜酸算岁虽荽谇祟绥隋随遂碎隧燧濉穗邃髓孙");
        sb.append("荪狲损笋隼飧榫所莎索唢唆娑琐桫梭挲睃锁蓑嗦嗍羧缩他它她沓挞闼趿铊塔塌遢阘溻榻踏獭蹋鳎太台汰邰抬");
        sb.append("苔态肽骀钛胎炱泰酞跆鲐薹叹坛坍忐坦昙贪炭钽倓郯袒谈探菼啴弹覃毯摊锬痰滩碳谭瘫潭檀汤倘唐烫堂铴淌");
        sb.append("棠傥鄌搪塘溏耥瑭嘡趟樘镋躺膛羰螗镗糖螳讨逃洮桃套涛陶绦掏萄啕淘绹滔韬鼗饕忑忒特铽慝疼腾誊熥滕螣");
        sb.append("藤体屉剃剔倜逖涕悌绨梯惕替提啼锑鹈缇题踢醍蹄嚏鳀天田忝殄畋恬掭甜添腆湉填阗舔黇条苕佻迢挑祧调眺");
        sb.append("笤窕粜龆跳蜩髫鲦帖贴铁萜餮厅汀廷町听挺莛亭庭烃珽梃铤停葶蜓颋艇婷霆同佟彤峂茼峒恸统捅桐砼通桶铜");
        sb.append("筒痛童酮嗵僮潼橦曈瞳头投透偷骰土凸吐秃图钍兔突荼徒途涂堍菟屠葖酴团抟彖湍疃退推蜕颓腿煺褪屯氽吞");
        sb.append("囤饨豚鲀暾臀托驮佗妥陀拓拖坨沱驼柝柁砣鸵唾脱庹椭酡跎箨橐鼍瓦佤挖哇洼娃袜娲蛙腽外呙歪万丸芄纨完");
        sb.append("玩宛弯顽挽莞剜菀晚脘烷惋婉绾琬塆皖腕湾碗畹蜿箢豌亡王网妄忘汪枉旺罔往望惘辋魍卫韦为未伟伪危违苇");
        sb.append("围帏位闱沩尾纬玮味委炜威畏胃洧桅涠诿娓萎唯帷逶偎惟谓尉隈隗维葳喂崴嵬猥猬渭韪微痿煨溦蔚鲔潍慰薇");
        sb.append("魏鳂鳚巍文刎问吻汶纹闻蚊紊阌揾雯温辒稳瘟鳁瓮翁蓊嗡滃鹟蕹我肟沃卧挝莴倭涡握硪幄渥窝蜗斡龌兀无五");
        sb.append("午勿乌毋戊务阢圬伍仵邬污坞芜芴杌巫吾吴呜迕庑怃忤妩武物郚钨侮诬误屋捂唔浯悟梧晤牾焐靰鹀铻痦婺骛");
        sb.append("鹉雾蜈舞寤鹜鋈鼯夕习兮西吸汐戏希饩系屃昔析穸细郗饻洗唏牺息奚玺席浠绤菥觋硒袭晞徙悉阋烯淅惜喜葸");
        sb.append("晰稀舄舾翕粞犀隙锡溪裼禊媳蓰熙豨蜥僖熄屣嘻膝潟嬉熹樨螅歙羲窸禧隰檄蟋醯曦鼷下吓匣呷侠狎柙虾峡狭");
        sb.append("夏硖遐瑕暇辖瞎霞罅黠仙先纤苋县岘氙闲现贤狝冼祆弦限线挦咸显籼涎宪险莶蚬猃陷娴掀铣衔舷馅筅痫鹇羡");
        sb.append("献酰跣跹锨腺嫌鲜暹藓燹霰乡芗向享详项巷相响香饷庠祥厢象翔湘缃飨想像鲞橡箱襄骧镶小孝肖枭枵削哓洨");
        sb.append("骁校逍晓哮鸮笑效消宵绡猇萧啸崤淆硝销蛸筱箫潇霄魈嚣写协邪血些胁泄泻绁挟卸屑械偕斜谐揳亵渫谢携塮");
        sb.append("楔歇榭榍撷鞋蝎勰缬薤獬邂廨澥懈燮蟹瀣躞心囟芯辛忻昕欣信衅锌新歆薪镡馨鑫刑邢行饧兴形杏陉幸性姓型");
        sb.append("荇荥星钘骍硎悻婞猩惺腥醒擤凶兄芎匈汹胸雄熊朽休秀岫咻修庥羞袖绣琇鸺锈嗅貅馐滫溴髹圩戌吁旭许序盱");
        sb.append("诩砉须叙洫恤胥顼栩徐酗虚勖绪续溆絮婿蓄煦墟蓿需嘘魆糈醑玄轩泫选炫宣绚眩铉痃烜悬旋谖揎萱喧渲瑄楦");
        sb.append("暅暄煊碹漩璇儇禤癣穴茓学雪谑靴踅薛鳕训讯旬汛寻迅驯巡郇询荀勋峋徇洵浔恂逊珣埙栒殉循巽熏鲟蕈噀薰");
        sb.append("獯曛醺丫牙轧亚压伢讶芽迓呀岈玡押垭砑鸦哑娅鸭蚜氩崖涯揠雅睚衙厌延严言妍奄岩兖炎沿埏研砚咽俨衍弇");
        sb.append("彦恹艳盐晏唁胭烟剡宴验掩焉郾厣眼崦偃阉阎淹谚琰堰雁蜒筵焰焱湮扊鄢罨滟酽演嫣魇餍颜谳燕赝檐鼹央扬");
        sb.append("仰羊阳杨旸炀佯疡泱怏垟殃徉养洋样鸯氧秧恙烊痒蛘鞅漾幺夭爻尧吆妖杳肴药要轺咬峣姚珧舀窅窈窑谣摇徭");
        sb.append("遥腰瑶靿鹞邀繇曜鳐耀也业叶页曳爷邺冶耶夜晔倻烨揶掖野铘液谒椰腋馌靥噎一乙乂弋亿义已艺刈忆以匜仡");
        sb.append("仪议圯夷屹钇伊亦衣异抑苡医呓邑佚役沂译诒矣易峄迤佾依饴怿怡宜祎诣驿绎荑轶咦蚁咿贻舣弈奕疫姨羿挹");
        sb.append("酏眙倚胰益浥悒扅谊埸勩铱移逸猗痍翊翌揖壹椅遗颐嗌肄裔意溢缢蜴疑廙瘗旖漪鹝镒毅熠薏殪螠噫劓翳繄嶷");
        sb.append("簃臆翼黟镱癔彝懿尹引印因阴吟吲饮茚垠茵荫胤音洇姻蚓氤殷狺崟铟银淫寅隐堙喑愔鄞龈夤窨慭瘾嚚霪迎应");
        sb.append("英茔荧郢映盈莹莺萤营萦婴瑛硬颍蓥楹媵颖滢撄蝇嘤罂潆缨璎樱影鹦瘿嬴膺赢鹰瀛哟唷用永佣甬拥咏泳俑勇");
        sb.append("痈涌邕庸恿喁蛹鄘雍墉踊慵颙鲬镛壅臃鳙饔又友尤右由幼有优酉卣邮佑攸犹忧呦侑油柚囿幽疣羑宥诱莠莜莸");
        sb.append("铀蚰蚴铕悠釉鱿游鲉猷蝣牖黝鼬耰于与予玉驭迂芋屿伛宇聿羽纡玙欤余饫妪妤盂雨郁臾鱼於育禺昱竽俣禹俞");
        sb.append("狱语彧圄峪钰狳馀浴谀娱预域堉萸雩圉欲庾阈渔淤谕隅揄遇喻嵎嵛御逾鹆腴渝愉寓裕瑀瑜蓣榆虞愚觎愈瘐煜");
        sb.append("滪誉蜮毓舆窬龉蝓潏窳豫燠燏鹬鬻元远芫园员沅苑鸢垣爰怨院袁垸原圆眢鸳冤渊鼋援掾湲媛缘瑗塬蜎猿源愿");
        sb.append("辕橼螈曰月刖约玥岳哕钥钺阅悦跃越粤樾龠瀹云匀允孕运芸狁沄纭昀郓郧恽陨耘晕涢酝殒愠韫氲筠筼韵鋆蕰");
        sb.append("蕴熨赟扎匝杂咂咋拶砸臜再在灾甾哉栽载宰崽咱昝暂糌錾赞簪攒瓒趱驵赃脏奘牂葬臧早皂灶枣蚤唣造凿慥遭");
        sb.append("噪簉澡璪糟燥藻躁仄则责择昃迮泽啧帻舴箦赜贼怎谮锃增憎缯赠甑罾札乍诈拃闸栅眨咤炸砟哳痄蚱铡揸喳渣");
        sb.append("溠楂鲊榨宅债斋窄摘寨瘵占斩沾栈战毡飐盏站旃展崭绽湛搌詹辗谵瞻蘸丈仉仗杖帐张账胀涨章掌鄣障嶂幛獐");
        sb.append("彰漳嫜璋樟瘴蟑爪召兆找钊诏招沼赵昭笊棹照罩肇折这者柘哲浙晢辄喆蛰蜇锗谪摺蔗遮赭磔辙鹧褶圳贞阵针");
        sb.append("诊枕侦珍轸帧胗浈鸩振真桢砧畛朕疹袗祯赈蓁斟甄溱缜榛震镇箴臻正争证征郑怔诤政挣拯峥狰钲症烝睁铮筝");
        sb.append("蒸徵整之支止只卮汁执芝至旨址扺志芷吱豸沚忮纸直枝郅帜帙制知侄质肢炙泜治祉织指栉枳栀轵峙胝庤祗咫");
        sb.append("陟贽挚桎轾致秩值脂埴鸷掷职梽趾铚痔窒絷植殖黹跖蛭智痣滞骘彘酯置锧雉稚滍摭蜘踬踯觯中仲众忠肿终盅");
        sb.append("钟种重衷冢踵螽舟州纣肘诌咒周宙帚妯绉轴胄洲昼酎辀皱啁鸼粥碡骤籀主朱竹伫苎助住纻拄杼贮邾竺侏注诛");
        sb.append("驻茱柱炷洙祝珠株逐疰烛诸蛀铢舳猪渚煮蛛铸筑瘃褚翥槠箸潴嘱橥麈瞩蠋躅抓拽专转砖啭赚撰颛篆馔壮妆庄");
        sb.append("状桩装撞坠追骓缀椎惴缒锥赘肫窀准谆灼拙茁卓斫浊捉酌桌倬浞诼著棁啄着涿琢焯禚擢濯镯子仔自字孜姊耔");
        sb.append("茈呲秭咨姿籽兹笫资恣梓眦渍淄缁辎紫嗞嵫孳滋趑觜訾锱滓龇镃鼒髭鲻纵宗疭总偬综棕腙粽踪鬃走邹驺奏诹");
        sb.append("陬揍鄹鲰足诅阻卒组俎祖租菹族镞钻缵纂攥躜最罪槜蕞醉嘴尊撙遵樽鳟左佐作坐阼怍柞昨胙祚唑座笮做酢嘬");
        return sb.toString();
    }

    /**
     * 按笔画排列的汉字
     * 
     * @return 汉字笔画排序表
     * @version 1.0
     */
    public static String stroke() {
        StringBuilder sb = new StringBuilder();
        sb.append("一乙二十丁厂七卜八人入乂儿九匕几刁了乃刀力又乜三干亍于亏士土工才下寸丈大兀与万弋上小口山巾千乞");
        sb.append("川亿彳个么久勺丸夕凡及广亡门丫义之尸已巳弓己卫孑子孓也女飞刃习叉马乡幺丰王井开亓夫天元无韦云专");
        sb.append("丐扎廿艺木五支厅卅不仄太犬区历友歹尤匹厄车巨牙屯戈比互切瓦止少曰日中贝内水冈见手午牛毛气壬升夭");
        sb.append("长仁仃什片仆仉化仇币仂仍仅斤爪反兮刈介父爻从仑今凶分乏公仓月氏勿风欠丹匀乌勾殳凤卞六文亢方闩火");
        sb.append("为斗忆计订户讣认讥冗心尹尺夬引丑爿巴孔队办以允邓予劝双书毋幻玉刊末未示击邗戋打巧正扑卉扒邛功扔");
        sb.append("去甘世艾艽古节艿本术札可叵匝丙左厉丕石右布夯龙戊平灭轧东匜劢卡北占凸卢业旧帅归目旦且叮叶甲申号");
        sb.append("电田由卟叭只央史叱叽兄叼叩叫叻叨另叹冉皿凹囚四生失矢氕乍禾仨仕丘付仗代仙仟仡仫伋们仪白仔他仞斥");
        sb.append("卮瓜乎丛令用甩印氐乐尔句匆犰册卯犯外处冬鸟务刍包饥主市庀邝立冯邙玄闪兰半汀汁汇头汈汉忉宁穴宄它");
        sb.append("讦讧讨写让礼讪讫训必议讯记永司尻尼民弗弘阢出阡辽奶奴尕加召皮边孕发圣对弁台矛纠驭母幼丝匡耒邦玎");
        sb.append("玑式迂刑邢戎动圩圬圭扛寺吉扣扦圪考托圳老圾巩执扩圹扪扫圯圮地扬场耳芋芏共芊芍芨芄芒亚芝芎芑芗朽");
        sb.append("朴机权过亘臣吏再协西压厌厍戌在百有存而页匠夸夺夼灰达戍尥列死成夹夷轨邪尧划迈毕至此乩贞师尘尖劣");
        sb.append("光当吁早吐吓旯曳虫曲团同吕吊吃因吸吗吆屿屹岌帆岁回岂屺则刚网肉凼囝囡钆钇年朱缶氘氖牝先丢廷舌竹");
        sb.append("迁乔迄伟传乒乓休伍伎伏伛优臼伢伐仳延佤仲仵件任伤伥价伦份伧华仰伉仿伙伪伫自伊血向囟似后行甪舟全");
        sb.append("会杀合兆企汆氽众爷伞创刖肌肋朵杂夙危旬旭旮旨负犴刎犷匈犸舛各名多凫争邬色饧冱壮冲妆冰庄庆亦刘齐");
        sb.append("交次衣产决亥邡充妄闭问闯羊并关米灯州汗污江汕汔汲汐汛汜池汝汤汊忖忏忙兴宇守宅字安讲讳讴军讵讶祁");
        sb.append("讷许讹论讼农讽设访诀聿寻那艮厾迅尽导异弛阱阮孙阵阳收阪阶阴防丞奸如妁妇妃好她妈戏羽观牟欢买纡红");
        sb.append("纣驮纤纥驯纨约级纩纪驰纫巡寿玕弄玙麦玖玚玛形进戒吞远违韧运扶抚坛抟技坏抔抠坜扰扼拒找批扯址走抄");
        sb.append("汞坝贡攻赤圻折抓扳坂抡扮抢扺孝坎坍均坞抑抛投抃坟坑抗坊抖护壳志扭块抉声把报拟抒却劫毐芙芫芜苇邯");
        sb.append("芸芾芰苈苊苣芽芷芮苋芼苌花芹芥苁芩芬苍芪芴芡芟苄芳严苎芦芯劳克芭苏苡杆杜杠材村杖杌杏杉巫杓极杧");
        sb.append("杞李杨杈求忑孛甫匣更束吾豆两邴酉丽医辰励邳否还矶奁豕尬歼来忒连欤轩轪轫迓邶忐芈步卤卣邺坚肖旰旱");
        sb.append("盯呈时吴呋助县里呓呆吱吠呔呕园呖呃旷围呀吨旸吡町足虬邮男困吵串呙呐呗员听吟吩呛吻吹呜吭吣吲吼邑");
        sb.append("吧囤别吮岍帏岐岖岈岗岘帐岑岚兕财囵囫钉针钊钋钌迕氙氚牡告我乱利秃秀私岙每佞兵邱估体何佐伾佑攸但");
        sb.append("伸佃佚作伯伶佣低你佝佟住位伴佗身皂伺佛伽囱近彻役彷返佘余希佥坐谷孚妥豸含邻坌岔肝肟肛肚肘肠邸龟");
        sb.append("甸奂免劬狂犹狈狄角删狃狁鸠条彤卵灸岛邹刨饨迎饩饪饫饬饭饮系言冻状亩况亨庑床庋库庇疔疖疗吝应冷这");
        sb.append("庐序辛肓弃冶忘闰闱闲闳间闵闶闷羌判兑灶灿灼炀弟沣汪沅沄沐沛沔汰沤沥沌沘沏沚沙汩汨汭汽沃沂沦汹汾");
        sb.append("泛沧沨沟没汴汶沆沩沪沈沉沁泐怃忮怀怄忧忡忤忾怅忻忪怆忭忱快忸完宋宏牢究穷灾良证诂诃启评补初社祀");
        sb.append("祃诅识诈诉罕诊诋诌词诎诏诐译诒君灵即层屁屃尿尾迟局改张忌际陆阿孜陇陈阽阻阼附坠陀陂陉妍妩妓妪妣");
        sb.append("妙妊妖妗姊妨妫妒妞姒妤努邵劭忍刭劲甬邰矣鸡纬纭驱纯纰纱纲纳纴纵驳纶纷纸纹纺纻驴纽纾奉玩玮环玡武");
        sb.append("青责现玫玠玢玥表玦甙盂忝规匦抹卦邽坩坷坯拓垅拢拔抨坪拣拤拈坫垆坦担坤押抻抽拐拃拖拊者拍顶坼拆拎");
        sb.append("拥抵坻拘势抱拄垃拉拦幸拌拧坨坭抿拂拙招坡披拨择拚抬拇坳拗耵其耶取茉苷苦苯昔苛苤若茂茏苹苫苴苜苗");
        sb.append("英苒苘茌苻苓茚苟茆茑苑苞范茓茔茕直苠茀茁茄苕茎苔茅枉林枝杯枢枥柜枇杪杳枘枧杵枚枨析板枞松枪枫构");
        sb.append("杭枋杰述枕杻杷杼丧或画卧事刺枣雨卖矸郁矻矾矽矿砀码厕奈刳奔奇奄奋态瓯欧殴垄殁郏妻轰顷转轭斩轮软");
        sb.append("到郅鸢非叔歧肯齿些卓虎虏肾贤尚盱旺具昊昙果味杲昃昆国哎咕昌呵咂畅呸昕明易咙昀昂旻昉炅咔畀虮迪典");
        sb.append("固忠咀呷呻黾咒咋咐呱呼呤咚鸣咆咛咏呢咄呶咖呦咝岵岢岸岩帖罗岿岬岫帜帙帕岭岣峁刿峂迥岷剀凯帔峄沓");
        sb.append("败账贩贬购贮囹图罔钍钎钏钐钓钒钔钕钗邾制知迭氛迮垂牦牧物乖刮秆和季委竺秉迤佳侍佶岳佬佴供使侑佰");
        sb.append("侉例侠臾侥版侄岱侦侣侗侃侧侏凭侨侩佻佾佩货侈侪佼依佯侬帛卑的迫阜侔质欣郈征徂往爬彼径所舍金刽郐");
        sb.append("刹命肴郄斧怂爸采籴觅受乳贪念贫忿瓮戗肼肤朊肺肢肽肱肫肿肭胀朋肷股肮肪肥服胁周剁昏迩郇鱼兔狉狙狎");
        sb.append("狐忽狝狗狍狞狒咎备炙枭饯饰饱饲饳饴冽变京享冼庞店夜庙府底庖疟疠疝疙疚疡剂卒郊兖庚废净妾盲放於刻");
        sb.append("劾育氓闸闹郑券卷单炜炬炖炒炝炊炕炎炉炔沫浅法泔泄沽沭河泷沾泸沮泪油泱泅泗泊泠泜泺泃沿泖泡注泣泫");
        sb.append("泮泞沱泻泌泳泥泯沸泓沼波泼泽泾治怔怯怙怵怖怦怛怏性怍怕怜怩怫怊怿怪怡学宝宗定宕宠宜审宙官空帘穸");
        sb.append("穹宛实宓诓诔试郎诖诗诘戾肩房诙戽诚郓衬衫衩祆祎祉视祈诛诜话诞诟诠诡询诣诤该详诧诨诩建肃隶录帚屉");
        sb.append("居届刷鸤屈弧弥弦承孟陋戕陌孤孢陕亟降函陔限卺妹姑姐妲妯姓姗妮始帑弩孥驽姆虱迦迢驾叁参迨艰线绀绁");
        sb.append("绂练驵组绅细驶织驷驸驹终绉驺驻绊驼绋绌绍驿绎经骀贯甾砉耔契贰奏春帮珏珐珂珑玷玳珀顸珍玲珊珉珈玻");
        sb.append("毒型韨拭挂封持拮拷拱垭挝垣项垮挎垯挞城挟挠垤政赴赵赳贲垱挡拽垌哉垲挺括挢埏郝垍垧垢拴拾挑垛指垫");
        sb.append("挣挤垓垟拼垞挖按挥挦挪垠拯拶某甚荆茸革茜茬荐荙巷荚荑贳荛荜茈带草茧茼莒茵茴茱莛荞茯荏荇荃荟茶荀");
        sb.append("茗荠茭茨荒垩茳茫荡荣荤荥荦荧荨茛故荩胡荪荫茹荔南荬荭药柰标栈柑枯栉柯柄柘栊柩枰栋栌相查柙枵柚枳");
        sb.append("柞柏柝栀柃柢栎枸栅柳柱柿栏柈柠柁枷柽树勃剌郚剅要酊郦柬咸威歪甭研砖厘砗厚砑砘砒砌砂泵砚斫砭砜砍");
        sb.append("面耐耍奎耷牵鸥虺残殂殃殇殄殆轱轲轳轴轵轶轷轸轹轺轻鸦虿皆毖韭背战觇点虐临览竖尜省削尝哐昧眄眍盹");
        sb.append("是郢眇眊盼眨昽眈哇咭哄哑显冒映禺哂星昨咴曷昴咧昱昵咦哓昭哔畎畏毗趴呲胄胃贵畋畈界虹虾虼虻蚁思蚂");
        sb.append("盅咣虽品咽骂哕剐郧勋咻哗囿咱咿响哌哙哈哚咯哆咬咳咩咪咤哝哪哏哞哟峙炭峡峣罘帧罚峒峤峋峥峧帡贱贴");
        sb.append("贶贻骨幽钘钙钚钛钝钞钟钡钠钢钣钤钥钦钧钨钩钪钫钬钭钮钯卸缸拜看矩矧毡氡氟氢牯怎郜牲选适秕秒香种");
        sb.append("秭秋科重复竽竿笈笃俦段俨俅便俩俪叟垡贷牮顺修俏俣俚保俜促俄俐侮俭俗俘信皇泉皈鬼侵禹侯追俑俟俊盾");
        sb.append("逅待徊徇徉衍律很须舢舣叙俞弇郗剑逃俎卻爰郛食瓴盆胚胧胨胩胪胆胛胂胜胙胍胗胝朐胞胖脉胫胎鸨匍勉狨");
        sb.append("狭狮独狯狰狡飐飑狩狱狠狲訇訄逄昝贸怨急饵饶蚀饷饸饹饺饻胤饼峦弯孪娈将奖哀亭亮庤度弈奕迹庭庥疬疣");
        sb.append("疥疭疮疯疫疢疤庠咨姿亲竑音彦飒帝施闺闻闼闽闾闿阀阁阂差养美羑姜迸叛送类籼迷籽娄前酋首逆兹总炳炻");
        sb.append("炼炟炽炯炸烀烁炮炷炫烂烃剃洼洁洱洪洹洒洧洌浃柒浇泚浈浉浊洞洇洄测洙洗活洑涎洎洫派浍洽洮染洵洚洺");
        sb.append("洛浏济洨浐洋洴洣洲浑浒浓津浔浕洳恸恃恒恹恢恍恫恺恻恬恤恰恂恪恼恽恨举觉宣宦宥宬室宫宪突穿窀窃客");
        sb.append("诫冠诬语扁扃袆衲衽袄衿袂祛祜祓祖神祝祚诮祗祢祠误诰诱诲诳鸩说昶诵郡垦退既屋昼咫屏屎弭费陡逊牁眉");
        sb.append("胥孩陛陟陧陨除险院娃姞姥娅姨娆姻姝娇姚姽姣姘姹娜怒架贺盈怼羿勇炱怠癸蚤柔矜垒绑绒结绔骁绕骄骅绗");
        sb.append("绘给绚彖绛络骆绝绞骇统骈耕耘耖耗耙艳挈恝泰秦珥珙顼珰珠珽珩珧珣珞琤班珲敖素匿蚕顽盏匪恚捞栽捕埔");
        sb.append("埂捂振载赶起盐捎捍埕捏埘埋捉捆捐埚埙损袁挹捌都哲逝耆耄捡挫捋埒换挽贽挚热恐捣垸壶捃捅盍埃挨耻耿");
        sb.append("耽聂莰茝荸莆恭莽莱莲莳莫莴莪莉莠莓荷莜莅荼莶莩荽获莸荻莘晋恶莎莞莹莨莺真莙鸪莼框梆桂桔栲栳郴桓");
        sb.append("栖桡桎桢桄档桐桤株梃栝桥桕桦桁栓桧桃桅栒格桩校核样栟桉根栩逑索逋彧哥速鬲豇逗栗贾酐酎酌配酏逦翅");
        sb.append("辱唇厝孬夏砝砹砸砺砰砧砷砟砼砥砾砣础破硁恧原套剞逐砻烈殊殉顾轼轾轿辀辁辂较鸫顿趸毙致剕龀柴桌鸬");
        sb.append("虔虑监紧逍党眬唛逞晒晟眩眠晓眙唝哧哳哮唠鸭晃哺哽唔晔晌晁剔晏晖晕鸮趵趿畛蚌蚨蚜蚍蚋蚬畔蚝蚧蚣蚊");
        sb.append("蚪蚓哨唢哩圃哭圄哦唣唏恩盎唑鸯唤唁哼唧啊唉唆帱崂崃罡罢罟峭峨峪峰圆觊峻贼贿赂赃赅赆钰钱钲钳钴钵");
        sb.append("钷钹钺钻钼钽钾钿铀铁铂铃铄铅铆铈铉铊铋铌铍铎眚缺氩氤氦氧氨毪特牺造乘敌舐秣秫秤租秧积盉秩称秘透");
        sb.append("笄笕笔笑笊笫笏笋笆俸倩债俵倻借偌值倚俺倾倒俳俶倬倏倘俱倡候赁恁倭倪俾倜隼隽倞俯倍倦倓倌倥臬健臭");
        sb.append("射皋躬息郫倨倔衄颀徒徕徐殷舰舨舱般航舫瓞途拿釜耸爹舀爱豺豹奚鬯衾鸰颁颂翁胯胰胱胴胭脍脎脆脂胸胳");
        sb.append("脏脐胶脑胲胼朕脒胺脓鸱玺鱽鸲逛狴狸狷猁狳猃狺逖狼卿狻逢桀鸵留袅眢鸳皱饽饿馀馁凌凇凄栾挛恋桨浆衰");
        sb.append("勍衷高亳郭席准座脊症疳疴病疽疸疾痄斋疹痈疼疱疰痃痂疲痉效离衮紊唐凋颃瓷资恣凉站剖竞部旁旆旄旅旃");
        sb.append("畜阃阄阅阆羞羔恙瓶桊拳敉粉料粑益兼朔郸烤烘烜烦烧烛烟烨烩烙烊剡郯烬递涛浙涝浡浦涑浯酒涞涟涉娑消");
        sb.append("涅涠浞涓涢涡浥涔浩海浜涂浠浴浮涣浼涤流润涧涕浣浪浸涨烫涩涌涘浚悖悚悟悭悄悍悝悃悒悔悯悦悌悢悛害");
        sb.append("宽宸家宵宴宾窍窅窄容窈剜宰案请朗诸诹诺读扅诼冢扇诽袜袪袒袖袗袍袢被袯祯祧祥课冥诿谀谁谂调冤谄谅");
        sb.append("谆谇谈谊剥恳展剧屑屐屙弱陵陬勐奘疍牂蚩祟陲陴陶陷陪烝姬娠娱娌娉娟娲恕娥娩娴娣娘娓婀砮哿畚通能难");
        sb.append("逡预桑剟绠骊绡骋绢绣验绤绥绦骍继绨骎骏邕鸶猇彗耜焘舂琎球琏琐理琇麸琉琅捧掭堵揶措描埴域捺掎埼掩");
        sb.append("埯捷捯排焉掉掳掴埸堌捶赦赧推堆捭埠晢掀逵授捻埝堋教堍掏掐掬鸷掠掂掖培掊接堉掷掸控捩掮探悫埭埽据");
        sb.append("掘掺掇掼职聃基聆勘聊聍娶菁菝著菱萁菥菘堇勒黄萘萋勩菲菽菖萌萜萝菌萎萸萑菂菜棻菔菟萄萏菊萃菩菼菏");
        sb.append("萍菹菠菪菅菀萤营萦乾萧菰菡萨菇械梽彬梵梦婪梗梧梾梢梏梅觋检桴桷梓梳棁梯桫棂桶梭救啬郾匮曹敕副豉");
        sb.append("票鄄酝酞酗酚厢厣戚戛硎硅硭硒硕硖硗硐硚硇硌鸸瓠匏奢盔爽厩聋龚袭殒殓殍盛赉匾雩雪辄辅辆堑龁颅虚彪");
        sb.append("雀堂常眶眭唪眦啧匙晡晤晨眺眵睁眯眼眸悬野圊啪啦喏喵啉勖曼晦晞晗晚冕啄啭啡畦趼趺距趾啃跃啮跄略蚶");
        sb.append("蛄蛎蛆蚰蚺蛊圉蚱蚯蛉蛀蛇蛏蚴唬累鄂唱患啰唾唯啤啥啁啕唿啐唼唷啴啖啵啶啷唳啸啜帻崖崎崦崭逻帼崮崔");
        sb.append("帷崟崤崩崞崇崆崛赇赈婴赊圈铐铑铒铕铗铘铙铚铛铜铝铞铟铠铡铢铣铤铥铧铨铩铪铫铭铬铮铯铰铱铲铳铴铵");
        sb.append("银铷矫氪牾甜鸹秸梨犁稆秽移秾逶笺筇笨笸笼笪笛笙笮符笱笠笥第笳笤笾笞敏偾做鸺偃偕袋悠偿偶偈偎偲傀");
        sb.append("偷您偬售停偻偏躯皑兜皎假衅鸻徘徙徜得衔舸舻舳盘舴舶船鸼舷舵斜龛盒鸽瓻敛悉欲彩领翎脚脖脯豚脶脸脞");
        sb.append("脬脱脘脲脧匐鱾象够逸猜猪猎猫猗凰猖猡猊猞猄猝斛觖猕猛馗祭馃馄馅馆凑减鸾毫孰烹庶庹麻庵庼庾庳痔痍");
        sb.append("疵痊痒痕廊康庸鹿盗章竟翊商旌族旎旋望袤率阇阈阉阊阋阌阍阎阏阐着羚羝羟盖眷粝粘粗粕粒断剪兽焐焊烯");
        sb.append("焓焕烽焖烷烺焌清渍添渚鸿淇淋淅淞渎涯淹涿渠渐淑淖挲淌淏混淠涸渑淮淦淆渊淫淝渔淘淳液淬涪淤淡淙淀");
        sb.append("涫深渌涮涵婆梁渗淄情惬悻惜惭悱悼惝惧惕惘悸惟惆惚惊惇惦悴惮惋惨惯寇寅寄寂逭宿窒窑窕密谋谌谍谎谏");
        sb.append("扈皲谐谑裆袱袼裈裉祷祸祲谒谓谔谕谖谗谙谚谛谜谝敝逮逯敢尉屠艴弹隋堕郿随蛋隅隈粜隍隗隆隐婧婊婞婳");
        sb.append("婕娼婢婚婵婶婉胬袈颇颈翌恿欸绩绪绫骐续骑绮绯绰骒绲绳骓维绵绶绷绸绹绺绻综绽绾绿骖缀缁巢喆耠琫琵");
        sb.append("琴琶琪瑛琳琦琢琥琨靓琼斑琰琮琯琬琛琚辇替鼋揳揍款堪堞搽塔搭塃揸堰揠堙揩越趄趁趋超揽提堤揖博揾颉");
        sb.append("揭喜彭揣塄揿插揪搜煮堠耋揄援搀蛰蛩絷塆裁揞搁搓搂搅揎壹握摒揆搔揉掾葜聒斯期欺联葑葚葫靰靸散葳惹");
        sb.append("蒇葬蒈募葺葛蒉葸萼蓇萩董葆葩葡敬葱蒋葶蒂蒌葓蒎落萱葖韩戟朝葭辜葵棒楮棱棋椰植森棼焚椟椅椒棹棵棍");
        sb.append("椤棰椎棉椑鹀赍棚椋椁棬棕棺榔楗棣椐椭鹁惠惑逼覃粟棘酣酤酢酥酡酦鹂觌厨厦硬硝硪硷确硫雁厥殖裂雄殚");
        sb.append("殛颊雳雯辊辋椠暂辌辍辎雅翘辈斐悲紫凿黹辉敞棠牚赏掌晴睐暑最晰量睑睇鼎睃喷戢喋嗒喃喳晶喇遇喊喱喹");
        sb.append("遏晷晾景喈畴践跖跋跌跗跞跚跑跎跏跛跆遗蛙蛱蛲蛭蛳蛐蛔蛛蜓蛞蜒蛤蛴蛟蛘蛑畯喁喝鹃喂喟斝喘啾嗖喤喉");
        sb.append("喻喑啼嗟喽嗞喧喀喔喙嵌嵘嵖幅崴遄詈帽嵎崽嵚嵬嵛翙嵯嵝嵫幄嵋赋赌赎赐赑赔黑铸铹铺铻铼铽链铿销锁锃");
        sb.append("锄锂锅锆锇锈锉锊锋锌锎锏锐锑锒锓锔锕甥掣掰短智矬氰毳毯氮毽氯犊犄犋鹄犍鹅颋剩嵇稍程稀黍稃税稂筐");
        sb.append("等筘筑策筚筛筜筒筅筏筵筌答筋筝傣傲傅傈舄牍牌傥堡集焦傍傧储遑皓皖粤奥傩遁街惩御徨循舾艇舒畲弑逾");
        sb.append("颌翕釉番释鹆禽舜貂腈腊腌腓腆腴脾腋腑腙腚腔腕腱腒鱿鲀鲁鲂鲃颍猢猹猩猥猬猾猴飓觞觚猸猱惫飧然馇馈");
        sb.append("馉馊馋亵装蛮脔就敦裒廋斌痣痨痦痘痞痢痤痪痫痧痛鄌赓竦童瓿竣啻颏鹇阑阒阔阕善翔羡普粪粞尊奠遒道遂");
        sb.append("孳曾焯焜焰焙焱鹈湛港渫滞湖湘渣渤湮湎湝湨湜渺湿温渴渭溃湍溅滑湃湫溲湟溆渝湲湾渡游溠溇湔滋湉渲溉");
        sb.append("渥湄滁愤慌惰愠惺愦愕惴愣愀愎惶愧愉愔慨喾割寒富寓窜窝窖窗窘寐谟扉遍棨雇扊裢裎裣裕裤裥裙祾祺祼谠");
        sb.append("禅禄幂谡谢谣谤谥谦谧塈遐犀属屡孱弼强粥巽疏隔骘隙隘媒媪絮嫂媛婷媚婿巯毵翚登皴婺骛缂缃缄缅彘缆缇");
        sb.append("缈缉缌缎缏缑缒缓缔缕骗编缗骙骚缘飨耢瑟瑚鹉瑁瑞瑰瑀瑜瑗瑄瑕遨骜瑙遘韫魂髡肆摄摸填搏塥塬鄢趔趑摅");
        sb.append("塌摁鼓摆赪携塮蜇搋搬摇搞搪塘搒搐搛搠摈彀毂搌搦摊搡聘蓁戡斟蒜蓍鄞勤靴靳靶鹊蓐蓝墓幕蓦鹋蒽蓓蓖蓊");
        sb.append("蒯蓟蓬蓑蒿蒺蓠蒟蒡蓄蒹蒴蒲蒗蓉蒙蓂蓥颐蒸献蓣楔椿楠禁楂楚楝楷榄想楫榀楞楸椴槐槌楯榆榇榈槎楼榉楦");
        sb.append("概楣楹椽裘赖剽甄酮酰酯酪酩酬蜃感碛碍碘碓碑硼碉碎碚碰碇碗碌碜鹌尴雷零雾雹辏辐辑辒输督频龃龄龅龆");
        sb.append("觜訾粲虞鉴睛睹睦瞄睚嗪睫韪嗷嗉睡睨睢雎睥睬嘟嗜嗑嗫嗬嗔鄙嗦嗝愚戥嗄暖盟煦歇暗暅暄暇照遢暌畸跬跨");
        sb.append("跶跷跸跐跣跹跳跺跪路跻跤跟遣蛸蜈蜎蜗蛾蜊蜍蜉蜂蜣蜕畹蛹嗣嗯嗅嗥嗲嗳嗡嗌嗍嗨嗤嗵嗓署置罨罪罩蜀幌");
        sb.append("嵊嵩嵴骰锖锗错锘锚锛锜锝锞锟锡锢锣锤锥锦锧锨锪锫锩锬锭键锯锰锱矮雉氲犏辞歃稞稚稗稔稠颓愁筹筠筢");
        sb.append("筮筻筲筼筱签简筷毁舅鼠牒煲催傻像躲鹎魁敫僇衙微徭愆艄觎毹愈遥貊貅貉颔腻腠腩腰腼腽腥腮腭腹腺腧鹏");
        sb.append("塍媵腾腿詹鲅鲆鲇鲈鲉鲊稣鲋鲌鲍鲏鲐肄猿颖鹐飔飕觥触解遛煞雏馌馍馏馐酱鹑禀亶廒瘃痱痹痼廓痴痿瘐瘁");
        sb.append("瘅痰瘆廉鄘麂裔靖新鄣歆韵意旒雍阖阗阘阙羧豢誊粳粮数煎猷塑慈煤煳煜煨煅煌煊煸煺滟溱溘滠满漭漠滢滇");
        sb.append("溥溧溽源滤滥裟溻溷溦滗滫溴滏滔溪滃溜滦漓滚溏滂溢溯滨溶滓溟滘溺滍粱滩滪愫慑慎慥慊誉鲎塞骞寞窥窦");
        sb.append("窠窣窟寝谨裱褂褚裸裼裨裾裰禊福谩谪谫谬群殿辟障媾嫫媳媲嫒嫉嫌嫁嫔媸叠缙缜缚缛辔缝骝缟缠缡缢缣缤");
        sb.append("骟剿耥璈静碧瑶璃瑭瑢獒赘熬觏慝嫠韬髦墈墙摽墟撇墁撂摞嘉摧撄赫截翥踅誓銎摭墉境摘墒摔榖撖摺綦聚蔫");
        sb.append("蔷靺靼鞅靽鞁靿蔌蔽慕暮摹蔓蔑甍蔸蓰蔹蔡蔗蔟蔺戬蕖蔻蓿蔼斡熙蔚鹕兢嘏蓼榛榧模槚槛榻榫槜榭槔榴槁榜");
        sb.append("槟榨榕槠榷榍歌遭僰酵酽酾酲酷酶酴酹酿酸厮碶碡碟碴碱碣碳碲磋磁碹碥愿劂臧豨殡需霆霁辕辖辗蜚裴翡雌");
        sb.append("龇龈睿裳颗夥瞅瞍睽墅嘞嘈嗽嘌嘁嘎暧暝踌踉跽踊蜻蜞蜡蜥蜮蜾蝈蜴蝇蜘蜱蜩蜷蝉蜿螂蜢嘘嘡鹗嘣嘤嘚嘛嘀");
        sb.append("嗾嘧罴罱幔嶂幛赙罂赚骷骶鹘锲锴锶锷锸锹锻锽锾锵锿镀镁镂镃镄镅舞犒舔稳熏箐箦箧箍箸箨箕箬算箅箩箪");
        sb.append("箔管箜箢箫箓毓舆僖儆僳僚僭僬劁僦僮僧鼻魄魅魃魆睾艋鄱貌膜膊膈膀膑鲑鲔鲙鲚鲛鲜鲟疑獐獍飗觫雒孵夤");
        sb.append("馑馒銮裹敲豪膏塾遮麽廙腐瘩瘌瘗瘟瘦瘊瘥瘘瘙廖辣彰竭韶端旗旖膂阚鄯鲞精粼粹粽糁歉槊鹚弊熄熘熔煽熥");
        sb.append("潢潆潇漤漆漕漱漂滹漫漯漶潋潴漪漉漳滴漩漾演澉漏潍慢慷慵寨赛搴寡窬窨窭察蜜寤寥谭肇綮谮褡褙褐褓褛");
        sb.append("褊褪禚谯谰谱谲暨屣鹛隧嫣嫱嫩嫖嫦嫚嫘嫜嫡嫪鼐翟翠熊凳瞀鹜骠缥缦缧骡缨骢缩缪缫镕慧耦耧瑾璜璀璎璁");
        sb.append("璋璇璆奭撵髯髫撷撕撒撅撩趣趟撑撮撬赭播墦擒撸鋆墩撞撤撙增撺墀撰聩聪觐鞋鞑蕙鞒鞍蕈蕨蕤蕞蕺瞢蕉劐");
        sb.append("蕃蕲蕰蕊赜蔬蕴鼒槿横樯槽槭樗樘樱樊橡槲樟橄敷鹝豌飘醋醌醇醉醅靥魇餍磕磊磔磙磅碾磉殣慭震霄霉霈辘");
        sb.append("龉龊觑瞌瞒题暴瞎瞑嘻嘭噎嘶噶嘲颙暹嘹影踔踝踢踏踟踬踩踮踣踯踪踺踞蝽蝶蝾蝴蝻蝠蝰蝎蝌蝮螋蝗蝓蝣蝼");
        sb.append("蝤蝙噗嘬颚嘿噍噢噙噜噌嘱噀噔颛幞幡嶓幢嶙嶝墨骺骼骸镊镆镇镈镉镋镌镍镎镏镐镑镒镓镔靠稽稷稻黎稿稼");
        sb.append("箱箴篑篁篌篓箭篇篆僵牖儇儋躺僻德徵艘磐虢鹞鹟膝膘膛滕鲠鲡鲢鲣鲥鲤鲦鲧鲩鲪鲫鲬橥獗獠觯鹠馓馔熟摩");
        sb.append("麾褒廛瘛瘼瘪瘢瘤瘠瘫齑鹡凛颜毅羯羰糊糇遴糌糍糈糅翦遵鹣憋熜熵熠潜澍澎澌潵潮潸潭潦鲨潲鋈潟澳潘潼");
        sb.append("澈澜潽潺澄潏懂憬憔懊憧憎寮窳额谳翩褥褴褫禤谴鹤谵憨熨慰劈履屦嬉勰戮蝥豫缬缭缮缯骣畿耩耨耪璞璟靛");
        sb.append("璠璘聱螯髻髭髹擀撼擂操熹甏擐擅擞磬鄹颞蕻鞘燕黇颟薤蕾薯薨薛薇檠擎薪薏蕹薮薄颠翰噩薜薅樾橱橛橇樵");
        sb.append("檎橹橦樽樨橙橘橼墼整橐融翮瓢醛醐醍醒醚醑觱磺磲赝飙殪霖霏霓霍霎錾辙辚臻冀餐遽氅瞟瞠瞰嚄嚆噤暾曈");
        sb.append("蹀蹅踶踹踵踽嘴踱蹄蹉蹁蹂螨蟒蟆螈螅螭螗螃螠螟噱器噪噬噫噻噼幪罹圜鹦赠默黔镖镗镘镚镛镜镝镞镠氇氆");
        sb.append("赞憩穑穆穄篝篚篥篮篡簉篦篪篷篙篱盥儒劓翱魉魈邀徼衡歙盦膨膪膳螣膦膙雕鲭鲮鲯鲰鲱鲲鲳鲴鲵鲷鲸鲺鲹");
        sb.append("鲻獴獭獬邂憝亸鹧磨廨赟癀瘭瘰廪瘿瘵瘴癃瘾瘸瘳斓麇麈凝辨辩嬴壅羲糙糗糖糕瞥甑燎燠燔燃燧燊燏濑濒濉");
        sb.append("潞澧澡澴激澹澥澶濂澼憷懒憾懈黉褰寰窸窿褶禧壁避嬖犟隰嬗鹨翯颡缰缱缲缳缴璨璩璐璪戴螫擤壕擦觳罄擢");
        sb.append("藉薹鞡鞠藏薷薰藐藓藁檬檑檄檐檩檀懋醢翳繄礁礅磷磴鹩霜霞龋龌豳壑黻瞭瞧瞬瞳瞵瞩瞪嚏曙嚅蹑蹒蹋蹈蹊");
        sb.append("蹓蹐蟥螬螵疃螳螺蟋蟑蟀嚎嚓羁罽罾嶷赡黜黝髁髀镡镢镣镤镥镦镧镨镩镪镫罅穗黏魏簧簌篾簃篼簏簇簖簋繁");
        sb.append("鼢黛儡鹪鼾皤魍徽艚龠爵繇貘邈貔臌朦臊膻臁臆臃鲼鲽鲾鳀鳁鳂鳃鳄鳅鳆鳇鳈鳉鳊獯螽燮鹫襄糜縻膺癍癌麋");
        sb.append("辫赢糟糠馘燥懑濡濮濞濠濯懦豁蹇謇邃襕襁臀檗甓臂擘孺隳嬷翼蟊鹬鍪骤鏊鳌鬹鬈鬃瞽藕鞯鞨鞭鞫鞧鞣藜藠");
        sb.append("藤藩鹲檫檵覆醪蹙礞礓礌燹餮蹩瞿瞻曛颢曜躇蹦鹭蹢蹜蟛蟪蟠蟮嚚嚣鹮黠黟髅髂镬镭镯镰镱馥簠簟簪簦鼫鼬");
        sb.append("鼩雠艟翻臑鳍鳎鳏鳐鳑鹱鹰癞癔癜癖糨冁瀑瀍瀌鎏懵襟璧戳彝邋鬏攉攒鞲鞴藿蘧孽蘅警蘑藻麓攀醭醮醯礤酃");
        sb.append("霪霭黼鳖曝嚯蹰蹶蹽蹼蹯蹴蹾蹲蹭蹿蹬蠖蠓蠋蟾蠊巅黢髋髌镲籀簸籁簿鳘齁魑艨鼗鳓鳔鳕鳗鳙鳚蟹颤靡癣麒");
        sb.append("鏖瓣蠃羸羹爆瀚瀣瀛襦谶襞疆骥缵瓒鬓壤攘馨蘩蘖蘘醵醴霰颥酆耀矍曦躁躅蠕鼍嚼嚷巍巉黩黥镳镴黧籍纂鼯");
        sb.append("犨臜鳜鳝鳞鳟獾魔糯灌瀹瀵譬孀骧耰蠢瓘鼙醺礴礳霸露霹颦曩躏黯髓鼱鳡鳢癫麝赣夔爝灏禳鐾羼蠡耲耱懿韂");
        sb.append("蘸鹳糵蘼囊霾氍饕躔躐髑镵镶穰鳤瓤饔鬻鬟趱攫攥颧躜罐鼹鼷癯麟蠲矗蠹醾躞衢鑫灞襻纛鬣攮囔馕戆蠼爨齉");
        return sb.toString();
    }

    /**
     * 按汉字是否常用进行排列
     * 
     * @return 汉字词频排序表
     * @version 1.0
     */
    public static String frequency() {
        StringBuilder sb = new StringBuilder();
        sb.append("一乙二十丁厂七卜人入八九几儿了力乃刀又三于干亏士工土才寸下大丈与万上小口巾山千乞川亿个勺久凡及夕丸么");
        sb.append("广亡门义之尸弓己已子卫也女飞刃习叉马乡丰王井开夫天无元专云扎艺木五支厅不太犬区历尤友匹车巨牙屯比互切");
        sb.append("瓦止少日中冈贝内水见午牛手毛气升长仁什片仆化仇币仍仅斤爪反介父从今凶分乏公仓月氏勿欠风丹匀乌凤勾文六");
        sb.append("方火为斗忆订计户认心尺引丑巴孔队办以允予劝双书幻玉刊示末未击打巧正扑扒功扔去甘世古节本术可丙左厉右石");
        sb.append("布龙平灭轧东卡北占业旧帅归且旦目叶甲申叮电号田由史只央兄叼叫另叨叹四生失禾丘付仗代仙们仪白仔他斥瓜乎");
        sb.append("丛令用甩印乐句匆册犯外处冬鸟务包饥主市立闪兰半汁汇头汉宁穴它讨写让礼训必议讯记永司尼民出辽奶奴加召皮");
        sb.append("边发孕圣对台矛纠母幼丝式刑动扛寺吉扣考托老执巩圾扩扫地扬场耳共芒亚芝朽朴机权过臣再协西压厌在有百存而");
        sb.append("页匠夸夺灰达列死成夹轨邪划迈毕至此贞师尘尖劣光当早吐吓虫曲团同吊吃因吸吗屿帆岁回岂刚则肉网年朱先丢舌");
        sb.append("竹迁乔伟传乒乓休伍伏优伐延件任伤价份华仰仿伙伪自血向似后行舟全会杀合兆企众爷伞创肌朵杂危旬旨负各名多");
        sb.append("争色壮冲冰庄庆亦刘齐交次衣产决充妄闭问闯羊并关米灯州汗污江池汤忙兴宇守宅字安讲军许论农讽设访寻那迅尽");
        sb.append("导异孙阵阳收阶阴防奸如妇好她妈戏羽观欢买红纤级约纪驰巡寿弄麦形进戒吞远违运扶抚坛技坏扰拒找批扯址走抄");
        sb.append("坝贡攻赤折抓扮抢孝均抛投坟抗坑坊抖护壳志扭块声把报却劫芽花芹芬苍芳严芦劳克苏杆杠杜材村杏极李杨求更束");
        sb.append("豆两丽医辰励否还歼来连步坚旱盯呈时吴助县里呆园旷围呀吨足邮男困吵串员听吩吹呜吧吼别岗帐财针钉告我乱利");
        sb.append("秃秀私每兵估体何但伸作伯伶佣低你住位伴身皂佛近彻役返余希坐谷妥含邻岔肝肚肠龟免狂犹角删条卵岛迎饭饮系");
        sb.append("言冻状亩况床库疗应冷这序辛弃冶忘闲间闷判灶灿弟汪沙汽沃泛沟没沈沉怀忧快完宋宏牢究穷灾良证启评补初社识");
        sb.append("诉诊词译君灵即层尿尾迟局改张忌际陆阿陈阻附妙妖妨努忍劲鸡驱纯纱纳纲驳纵纷纸纹纺驴纽奉玩环武青责现表规");
        sb.append("抹拢拔拣担坦押抽拐拖拍者顶拆拥抵拘势抱垃拉拦拌幸招坡披拨择抬其取苦若茂苹苗英范直茄茎茅林枝杯柜析板松");
        sb.append("枪构杰述枕丧或画卧事刺枣雨卖矿码厕奔奇奋态欧垄妻轰顷转斩轮软到非叔肯齿些虎虏肾贤尚旺具果味昆国昌畅明");
        sb.append("易昂典固忠咐呼鸣咏呢岸岩帖罗帜岭凯败贩购图钓制知垂牧物乖刮秆和季委佳侍供使例版侄侦侧凭侨佩货依的迫质");
        sb.append("欣征往爬彼径所舍金命斧爸采受乳贪念贫肤肺肢肿胀朋股肥服胁周昏鱼兔狐忽狗备饰饱饲变京享店夜庙府底剂郊废");
        sb.append("净盲放刻育闸闹郑券卷单炒炊炕炎炉沫浅法泄河沾泪油泊沿泡注泻泳泥沸波泼泽治怖性怕怜怪学宝宗定宜审宙官空");
        sb.append("帘实试郎诗肩房诚衬衫视话诞询该详建肃录隶居届刷屈弦承孟孤陕降限妹姑姐姓始驾参艰线练组细驶织终驻驼绍经");
        sb.append("贯奏春帮珍玻毒型挂封持项垮挎城挠政赴赵挡挺括拴拾挑指垫挣挤拼挖按挥挪某甚革荐巷带草茧茶荒茫荡荣故胡南");
        sb.append("药标枯柄栋相查柏柳柱柿栏树要咸威歪研砖厘厚砌砍面耐耍牵残殃轻鸦皆背战点临览竖省削尝是盼眨哄显哑冒映星");
        sb.append("昨畏趴胃贵界虹虾蚁思蚂虽品咽骂哗咱响哈咬咳哪炭峡罚贱贴骨钞钟钢钥钩卸缸拜看矩怎牲选适秒香种秋科重复竿");
        sb.append("段便俩贷顺修保促侮俭俗俘信皇泉鬼侵追俊盾待律很须叙剑逃食盆胆胜胞胖脉勉狭狮独狡狱狠贸怨急饶蚀饺饼弯将");
        sb.append("奖哀亭亮度迹庭疮疯疫疤姿亲音帝施闻阀阁差养美姜叛送类迷前首逆总炼炸炮烂剃洁洪洒浇浊洞测洗活派洽染济洋");
        sb.append("洲浑浓津恒恢恰恼恨举觉宣室宫宪突穿窃客冠语扁袄祖神祝误诱说诵垦退既屋昼费陡眉孩除险院娃姥姨姻娇怒架贺");
        sb.append("盈勇怠柔垒绑绒结绕骄绘给络骆绝绞统耕耗艳泰珠班素蚕顽盏匪捞栽捕振载赶起盐捎捏埋捉捆捐损都哲逝捡换挽热");
        sb.append("恐壶挨耻耽恭莲莫荷获晋恶真框桂档桐株桥桃格校核样根索哥速逗栗配翅辱唇夏础破原套逐烈殊顾轿较顿毙致柴桌");
        sb.append("虑监紧党晒眠晓鸭晃晌晕蚊哨哭恩唤啊唉罢峰圆贼贿钱钳钻铁铃铅缺氧特牺造乘敌秤租积秧秩称秘透笔笑笋债借值");
        sb.append("倚倾倒倘俱倡候俯倍倦健臭射躬息徒徐舰舱般航途拿爹爱颂翁脆脂胸胳脏胶脑狸狼逢留皱饿恋桨浆衰高席准座脊症");
        sb.append("病疾疼疲效离唐资凉站剖竞部旁旅畜阅羞瓶拳粉料益兼烤烘烦烧烛烟递涛浙涝酒涉消浩海涂浴浮流润浪浸涨烫涌悟");
        sb.append("悄悔悦害宽家宵宴宾窄容宰案请朗诸读扇袜袖袍被祥课谁调冤谅谈谊剥恳展剧屑弱陵陶陷陪娱娘通能难预桑绢绣验");
        sb.append("继球理捧堵描域掩捷排掉堆推掀授教掏掠培接控探据掘职基著勒黄萌萝菌菜萄菊萍菠营械梦梢梅检梳梯桶救副票戚");
        sb.append("爽聋袭盛雪辅辆虚雀堂常匙晨睁眯眼悬野啦晚啄距跃略蛇累唱患唯崖崭崇圈铜铲银甜梨犁移笨笼笛符第敏做袋悠偿");
        sb.append("偶偷您售停偏假得衔盘船斜盒鸽悉欲彩领脚脖脸脱象够猜猪猎猫猛馅馆凑减毫麻痒痕廊康庸鹿盗章竟商族旋望率着");
        sb.append("盖粘粗粒断剪兽清添淋淹渠渐混渔淘液淡深婆梁渗情惜惭悼惧惕惊惨惯寇寄宿窑密谋谎祸谜逮敢屠弹随蛋隆隐婚婶");
        sb.append("颈绩绪续骑绳维绵绸绿琴斑替款堪搭塔越趁趋超提堤博揭喜插揪搜煮援裁搁搂搅握揉斯期欺联散惹葬葛董葡敬葱落");
        sb.append("朝辜葵棒棋植森椅椒棵棍棉棚棕惠惑逼厨厦硬确雁殖裂雄暂雅辈悲紫辉敞赏掌晴暑最量喷晶喇遇喊景践跌跑遗蛙蛛");
        sb.append("蜓喝喂喘喉幅帽赌赔黑铸铺链销锁锄锅锈锋锐短智毯鹅剩稍程稀税筐等筑策筛筒答筋筝傲傅牌堡集焦傍储奥街惩御");
        sb.append("循艇舒番释禽腊脾腔鲁猾猴然馋装蛮就痛童阔善羡普粪尊道曾焰港湖渣湿温渴滑湾渡游滋溉愤慌惰愧愉慨割寒富窜");
        sb.append("窝窗遍裕裤裙谢谣谦属屡强粥疏隔隙絮嫂登缎缓编骗缘瑞魂肆摄摸填搏塌鼓摆携搬摇搞塘摊蒜勤鹊蓝墓幕蓬蓄蒙蒸");
        sb.append("献禁楚想槐榆楼概赖酬感碍碑碎碰碗碌雷零雾雹输督龄鉴睛睡睬鄙愚暖盟歇暗照跨跳跪路跟遣蛾蜂嗓置罪罩错锡锣");
        sb.append("锤锦键锯矮辞稠愁筹签简毁舅鼠催傻像躲微愈遥腰腥腹腾腿触解酱痰廉新韵意粮数煎塑慈煤煌满漠源滤滥滔溪溜滚");
        sb.append("滨粱滩慎誉塞谨福群殿辟障嫌嫁叠缝缠静碧璃墙撇嘉摧截誓境摘摔聚蔽慕暮蔑模榴榜榨歌遭酷酿酸磁愿需弊裳颗嗽");
        sb.append("蜻蜡蝇蜘赚锹锻舞稳算箩管僚鼻魄貌膜膊膀鲜疑馒裹敲豪膏遮腐瘦辣竭端旗精歉熄熔漆漂漫滴演漏慢寨赛察蜜谱嫩");
        sb.append("翠熊凳骡缩慧撕撒趣趟撑播撞撤增聪鞋蕉蔬横槽樱橡飘醋醉震霉瞒题暴瞎影踢踏踩踪蝶蝴嘱墨镇靠稻黎稿稼箱箭篇");
        sb.append("僵躺僻德艘膝膛熟摩颜毅糊遵潜潮懂额慰劈操燕薯薪薄颠橘整融醒餐嘴蹄器赠默镜赞篮邀衡膨雕磨凝辨辩糖糕燃澡");
        sb.append("激懒壁避缴戴擦鞠藏霜霞瞧蹈螺穗繁辫赢糟糠燥臂翼骤鞭覆蹦镰翻鹰警攀蹲颤瓣爆疆壤耀躁嚼嚷籍魔灌蠢霸露囊罐");
        sb.append("匕刁丐歹戈夭仑讥冗邓艾夯凸卢叭叽皿凹囚矢乍尔冯玄邦迂邢芋芍吏夷吁吕吆屹廷迄臼仲伦伊肋旭匈凫妆亥汛讳讶");
        sb.append("讹讼诀弛阱驮驯纫玖玛韧抠扼汞扳抡坎坞抑拟抒芙芜苇芥芯芭杖杉巫杈甫匣轩卤肖吱吠呕呐吟呛吻吭邑囤吮岖牡佑");
        sb.append("佃伺囱肛肘甸狈鸠彤灸刨庇吝庐闰兑灼沐沛汰沥沦汹沧沪忱诅诈罕屁坠妓姊妒纬玫卦坷坯拓坪坤拄拧拂拙拇拗茉昔");
        sb.append("苛苫苟苞茁苔枉枢枚枫杭郁矾奈奄殴歧卓昙哎咕呵咙呻咒咆咖帕账贬贮氛秉岳侠侥侣侈卑刽刹肴觅忿瓮肮肪狞庞疟");
        sb.append("疙疚卒氓炬沽沮泣泞泌沼怔怯宠宛衩祈诡帚屉弧弥陋陌函姆虱叁绅驹绊绎契贰玷玲珊拭拷拱挟垢垛拯荆茸茬荚茵茴");
        sb.append("荞荠荤荧荔栈柑栅柠枷勃柬砂泵砚鸥轴韭虐昧盹咧昵昭盅勋哆咪哟幽钙钝钠钦钧钮毡氢秕俏俄俐侯徊衍胚胧胎狰饵");
        sb.append("峦奕咨飒闺闽籽娄烁炫洼柒涎洛恃恍恬恤宦诫诬祠诲屏屎逊陨姚娜蚤骇耘耙秦匿埂捂捍袁捌挫挚捣捅埃耿聂荸莽莱");
        sb.append("莉莹莺梆栖桦栓桅桩贾酌砸砰砾殉逞哮唠哺剔蚌蚜畔蚣蚪蚓哩圃鸯唁哼唆峭唧峻赂赃钾铆氨秫笆俺赁倔殷耸舀豺豹");
        sb.append("颁胯胰脐脓逛卿鸵鸳馁凌凄衷郭斋疹紊瓷羔烙浦涡涣涤涧涕涩悍悯窍诺诽袒谆祟恕娩骏琐麸琉琅措捺捶赦埠捻掐掂");
        sb.append("掖掷掸掺勘聊娶菱菲萎菩萤乾萧萨菇彬梗梧梭曹酝酗厢硅硕奢盔匾颅彪眶晤曼晦冕啡畦趾啃蛆蚯蛉蛀唬啰唾啤啥啸");
        sb.append("崎逻崔崩婴赊铐铛铝铡铣铭矫秸秽笙笤偎傀躯兜衅徘徙舶舷舵敛翎脯逸凰猖祭烹庶庵痊阎阐眷焊焕鸿涯淑淌淮淆渊");
        sb.append("淫淳淤淀涮涵惦悴惋寂窒谍谐裆袱祷谒谓谚尉堕隅婉颇绰绷综绽缀巢琳琢琼揍堰揩揽揖彭揣搀搓壹搔葫募蒋蒂韩棱");
        sb.append("椰焚椎棺榔椭粟棘酣酥硝硫颊雳翘凿棠晰鼎喳遏晾畴跋跛蛔蜒蛤鹃喻啼喧嵌赋赎赐锉锌甥掰氮氯黍筏牍粤逾腌腋腕");
        sb.append("猩猬惫敦痘痢痪竣翔奠遂焙滞湘渤渺溃溅湃愕惶寓窖窘雇谤犀隘媒媚婿缅缆缔缕骚瑟鹉瑰搪聘斟靴靶蓖蒿蒲蓉楔椿");
        sb.append("楷榄楞楣酪碘硼碉辐辑频睹睦瞄嗜嗦暇畸跷跺蜈蜗蜕蛹嗅嗡嗤署蜀幌锚锥锨锭锰稚颓筷魁衙腻腮腺鹏肄猿颖煞雏馍");
        sb.append("馏禀痹廓痴靖誊漓溢溯溶滓溺寞窥窟寝褂裸谬媳嫉缚缤剿赘熬赫蔫摹蔓蔗蔼熙蔚兢榛榕酵碟碴碱碳辕辖雌墅嘁踊蝉");
        sb.append("嘀幔镀舔熏箍箕箫舆僧孵瘩瘟彰粹漱漩漾慷寡寥谭褐褪隧嫡缨撵撩撮撬擒墩撰鞍蕊蕴樊樟橄敷豌醇磕磅碾憋嘶嘲嘹");
        sb.append("蝠蝎蝌蝗蝙嘿幢镊镐稽篓膘鲤鲫褒瘪瘤瘫凛澎潭潦澳潘澈澜澄憔懊憎翩褥谴鹤憨履嬉豫缭撼擂擅蕾薛薇擎翰噩橱橙");
        sb.append("瓢蟥霍霎辙冀踱蹂蟆螃螟噪鹦黔穆篡篷篙篱儒膳鲸瘾瘸糙燎濒憾懈窿缰壕藐檬檐檩檀礁磷瞭瞬瞳瞪曙蹋蟋蟀嚎赡镣");
        sb.append("魏簇儡徽爵朦臊鳄糜癌懦豁臀藕藤瞻嚣鳍癞瀑襟璧戳攒孽蘑藻鳖蹭蹬簸簿蟹靡癣羹鬓攘蠕巍鳞糯譬霹躏髓蘸镶瓤矗");
        sb.append("乂乜亍兀弋彳丫巳孑孓幺亓韦廿卅仄厄曰壬仃仉仂兮刈爻殳卞亢闩讣尹夬爿毋邗戋卉邛艽艿札叵匝丕戊匜劢卟叱叩");
        sb.append("叻冉氕仨仕仟仡仫伋仞卮氐犰卯刍庀邝邙汀汈忉宄讦讧讪讫尻弗弘阢阡尕弁驭匡耒玎玑戎圩圬圭扦圪圳圹扪圯圮芏");
        sb.append("芊芨芄芎芑芗亘厍戌夼戍尥尧乩旯曳岌屺凼囝囡钆钇缶氘氖牝伎伛伢仳佤仵伥伧伉伫囟甪汆氽刖夙旮犴刎犷犸舛邬");
        sb.append("饧冱邡汕汔汲汐汜汝汊忖忏讴讵祁讷聿艮厾阮阪丞妁妃牟纡纣纥纨纩玕玙玚抟抔坜圻坂扺坍抃抉毐芫邯芸芾芰苈苊");
        sb.append("苣芷芮苋芼苌苁芩芪芴芡芟苄苎苡杌杓杧杞忑孛吾邴酉邳矶奁豕尬忒欤轪轫迓邶忐芈卣邺旰呋呓呔呖呃旸吡町虬呙");
        sb.append("呗吣吲岍帏岐岈岘岑岚兕囵囫钊钋钌迕氙氚岙佞邱佐伾攸佚佝佟佗伽彷佘佥孚豸坌肟邸奂劬狄狃狁邹饨饩饪饫饬亨");
        sb.append("庑庋疔疖肓闱闳闵闶羌炀沣沅沄沔沤沌沘沏沚汩汨汭沂汾沨汴汶沆沩沁泐怃忮怄忡忤忾怅忻忪怆忭忸诂诃祀祃诋诌");
        sb.append("诎诏诐诒屃孜陇阽阼陀陂陉妍妩妪妣妊妗妫妞姒妤邵劭刭甬邰矣纭纰纴纶纻纾玮玡玠玢玥玦甙盂忝匦邽坩垅抨拤拈");
        sb.append("坫垆抻拃拊坼拎坻坨坭抿拚坳耵耶苷苯苤茏苴苜苒苘茌苻苓茚茆茑苑茓茔茕苠茀苕枥枇杪杳枘枧杵枨枞枋杻杷杼矸");
        sb.append("矻矽砀刳瓯殁郏轭郅鸢盱昊杲昃咂呸昕昀旻昉炅咔畀虮迪咀呷黾咋呱呤咚咛咄呶呦咝岵岢岿岬岫帙岣峁刿峂迥岷剀");
        sb.append("帔峄沓囹罔钍钎钏钐钒钔钕钗邾迭迮牦竺迤佶佬佴侑佰侉臾岱侗侃侏侩佻佾侪佼佯侬帛阜侔郈徂郐郄怂籴戗肼朊肽");
        sb.append("肱肫肭肷剁迩郇狉狙狎狝狍狒咎炙枭饯饳饴冽冼庖疠疝疡兖庚妾於劾炜炖炝炔泔沭泷泸泱泅泗泠泜泺泃泖泫泮沱泯");
        sb.append("泓泾怙怵怦怛怏怍怩怫怊怿怡宕穸穹宓诓诔诖诘戾诙戽郓祆祎祉诛诜诟诠诣诤诧诨诩鸤戕孢亟陔卺妲妯姗妮帑弩孥");
        sb.append("驽迦迢迨绀绁绂驵驷驸绉驺绋绌驿骀甾砉耔珏珐珂珑玳珀顸珉珈韨拮垭挝垣垯挞垤赳贲垱拽垌哉垲挢埏郝垍垧垓垟");
        sb.append("垞挦垠拶茜荙荑贳荛荜茈茼莒茱莛茯荏荇荃荟荀茗茭茨垩茳荥荦荨茛荩荪荫茹荬荭柰栉柯柘栊柩枰栌柙枵柚枳柞柝");
        sb.append("栀柃柢栎枸柈柁柽剌郚剅酊郦甭砗砑砘砒斫砭砜奎耷虺殂殇殄殆轱轲轳轵轶轷轸轹轺虿毖觇尜哐眄眍郢眇眊昽眈哇");
        sb.append("咭禺哂咴曷昴昱咦哓哔畎毗呲胄畋畈虼虻咣哕剐郧咻囿咿哌哙哚咯咩咤哝哏哞峙峣罘帧峒峤峋峥峧帡贶贻钘钚钛钡");
        sb.append("钣钤钨钪钫钬钭钯矧氡氟牯郜秭竽笈笃俦俨俅俪叟垡牮俣俚俜皈禹俑俟逅徇徉舢舣俞弇郗俎卻爰郛瓴胨胩胪胛胂胙");
        sb.append("胍胗胝朐胫鸨匍狨狯飐飑狩狲訇訄逄昝饷饸饹饻胤孪娈庤弈庥疬疣疥疭疢庠竑彦闼闾闿阂羑迸籼酋兹炳炻炟炽炯烀");
        sb.append("炷烃洱洹洧洌浃泚浈浉洇洄洙洑洎洫浍洮洵洚洺浏洨浐洴洣浒浔浕洳恸恹恫恺恻恂恪恽宥宬窀扃袆衲衽衿袂祛祜祓");
        sb.append("祚诮祗祢诰诳鸩昶郡咫弭牁胥陛陟陧姞娅娆姝姽姣姘姹怼羿炱癸矜绔骁骅绗绚彖绛骈耖挈恝珥珙顼珰珽珩珧珣珞琤");
        sb.append("珲敖恚埔埕埘埚埙挹耆耄捋埒贽垸捃盍莰茝莆莳莴莪莠莓莜莅荼莶莩荽莸荻莘莎莞莨莙鸪莼桔栲栳郴桓桡桎桢桄桤");
        sb.append("梃栝桕桁桧栒栟桉栩逑逋彧鬲豇酐酎酏逦厝孬砝砹砺砧砷砟砼砥砣硁恧剞砻轼轾辀辁辂鸫趸剕龀鸬虔逍眬唛晟眩眙");
        sb.append("唝哧哳哽唔晔晁晏晖鸮趵趿畛蚨蚍蚋蚬蚝蚧唢圄哦唣唏盎唑帱崂崃罡罟峨峪觊赅赆钰钲钴钵钷钹钺钼钽钿铀铂铄铈");
        sb.append("铉铊铋铌铍铎眚氩氤氦毪舐秣盉笄笕笊笫笏俸倩俵倻偌俳俶倬倏恁倭倪俾倜隼隽倞倓倌倥臬皋郫倨衄颀徕舨舫瓞釜");
        sb.append("奚鬯衾鸰胱胴胭脍脎胲胼朕脒胺鸱玺鱽鸲狴狷猁狳猃狺逖狻桀袅眢饽馀凇栾挛勍亳疳疴疽疸痄痈疱疰痃痂痉衮凋颃");
        sb.append("恣旆旄旃阃阄阆恙桊敉粑朔郸烜烨烩烊剡郯烬浡涑浯涞涟娑涅涠浞涓涢浥涔浜浠浼浣涘浚悖悚悭悝悃悒悌悢悛宸窅");
        sb.append("窈剜诹扅诼冢袪袗袢袯祯祧冥诿谀谂谄谇屐屙陬勐奘疍牂蚩陲陴烝姬娠娌娉娟娲娥娴娣娓婀砮哿畚逡剟绠骊绡骋绤");
        sb.append("绥绦骍绨骎邕鸶彗耜焘舂琎琏琇掭揶埴掎埼埯捯焉掳掴埸堌赧捭晢逵埝堋堍掬鸷掊堉捩掮悫埭埽掇掼聃聆聍菁菝萁");
        sb.append("菥菘堇萘萋勩菽菖萜萸萑菂棻菔菟萏萃菼菏菹菪菅菀萦菰菡梽梵婪梾梏觋桴桷梓棁桫棂啬郾匮敕豉鄄酞酚厣戛硎硭");
        sb.append("硒硖硗硐硚硇硌鸸瓠匏厩龚殒殓殍赉雩辄堑龁眭唪眦啧晡眺眵眸圊啪喏喵啉勖晞晗啭趼趺啮跄蚶蛄蛎蚰蚺蛊圉蚱蛏");
        sb.append("蚴鄂啁啕唿啐唼唷啴啖啵啶啷唳啜帻崦帼崮帷崟崤崞崆崛赇赈铑铒铕铗铘铙铚铞铟铠铢铤铥铧铨铩铪铫铬铮铯铰铱");
        sb.append("铳铴铵铷氪牾鸹稆秾逶笺筇笸笪笮笱笠笥笳笾笞偾鸺偃偕偈偲偬偻皑皎鸻徜舸舻舳舴鸼龛瓻豚脶脞脬脘脲脧匐鱾猗");
        sb.append("猡猊猞猄猝斛觖猕馗馃馄鸾孰庹庼庾庳痔痍疵翊旌旎袤阇阈阉阊阋阌阍阏羚羝羟粝粕焐烯焓烽焖烷烺焌渍渚淇淅淞");
        sb.append("渎涿淖挲淏淠涸渑淦淝淬涪淙涫渌淄惬悻悱惝惘悸惟惆惚惇惮寅逭窕谌谏扈皲谑袼裈裉祲谔谕谖谗谙谛谝敝逯艴隋");
        sb.append("郿隈粜隍隗婧婊婞婳婕娼婢婵胬袈翌恿欸绫骐绮绯骒绲骓绶绹绺绻绾骖缁耠琫琵琶琪瑛琦琥琨靓琰琮琯琬琛琚辇鼋");
        sb.append("揳堞搽塃揸揠堙趄揾颉塄揿堠耋揄蛰蛩絷塆揞揎摒揆掾葜聒葑葚靰靸葳蒇蒈葺蒉葸萼蓇萩葆葩葶蒌葓蒎萱葖戟葭楮");
        sb.append("棼椟棹椤棰椑鹀赍椋椁棬楗棣椐鹁覃酤酢酡酦鹂觌硪硷厥殚殛雯辊辋椠辌辍辎斐黹牚睐睑睇睃戢喋嗒喃喱喹晷喈跖");
        sb.append("跗跞跚跎跏跆蛱蛲蛭蛳蛐蛞蛴蛟蛘蛑畯喁喟斝啾嗖喤喑嗟喽嗞喀喔喙嵘嵖崴遄詈嵎崽嵚嵬嵛翙嵯嵝嵫幄嵋赑铹铻铼");
        sb.append("铽铿锃锂锆锇锊锎锏锑锒锓锔锕掣矬氰毳毽犊犄犋鹄犍颋嵇稃稂筘筚筜筅筵筌傣傈舄傥傧遑皓皖傩遁徨舾畲弑颌翕");
        sb.append("釉鹆舜貂腈腓腆腴腑腙腚腱腒鱿鲀鲂鲃颍猢猹猥飓觞觚猸猱飧馇馈馉馊亵脔裒廋斌痣痨痦痞痤痫痧鄌赓竦瓿啻颏鹇");
        sb.append("阑阒阕粞遒孳焯焜焱鹈湛渫湮湎湝湨湜渭湍湫溲湟溆渝湲溠溇湔湉渲渥湄滁愠惺愦惴愣愀愎愔喾寐谟扉棨扊裢裎裣");
        sb.append("裥祾祺祼谠禅禄幂谡谥谧塈遐孱弼巽骘媪媛婷巯毵翚皴婺骛缂缃缄彘缇缈缉缌缏缑缒缗骙飨耢瑚瑁瑀瑜瑗瑄瑕遨骜");
        sb.append("瑙遘韫髡塥塬鄢趔趑摅摁赪塮蜇搋搒搐搛搠摈彀毂搌搦搡蓁戡蓍鄞靳蓐蓦鹋蒽蓓蓊蒯蓟蓑蒺蓠蒟蒡蒹蒴蒗蓂蓥颐蓣");
        sb.append("楠楂楝楫榀楸椴槌楯榇榈槎榉楦楹椽裘剽甄酮酰酯酩蜃碛碓碚碇碜鹌尴辏辒龃龅龆觜訾粲虞睚嗪睫韪嗷嗉睨睢雎睥");
        sb.append("嘟嗑嗫嗬嗔嗝戥嗄煦暅暄遢暌跬跶跸跐跣跹跻跤蛸蜎蜊蜍蜉蜣畹嗣嗯嗥嗲嗳嗌嗍嗨嗵罨嵊嵩嵴骰锖锗锘锛锜锝锞锟");
        sb.append("锢锧锪锫锩锬锱雉氲犏歃稞稗稔筠筢筮筻筲筼筱牒煲鹎敫僇徭愆艄觎毹貊貅貉颔腠腩腼腽腭腧塍媵詹鲅鲆鲇鲈鲉鲊");
        sb.append("稣鲋鲌鲍鲏鲐鹐飔飕觥遛馌馐鹑亶廒瘃痱痼痿瘐瘁瘅瘆鄘麂裔鄣歆旒雍阖阗阘阙羧豢粳猷煳煜煨煅煊煸煺滟溱溘滠");
        sb.append("漭滢滇溥溧溽裟溻溷溦滗滫溴滏滃滦溏滂溟滘滍滪愫慑慥慊鲎骞窦窠窣裱褚裼裨裾裰禊谩谪谫媾嫫媲嫒嫔媸缙缜缛");
        sb.append("辔骝缟缡缢缣骟耥璈瑶瑭瑢獒觏慝嫠韬髦墈摽墟墁撂摞撄翥踅銎摭墉墒榖撖摺綦蔷靺靼鞅靽鞁靿蔌甍蔸蓰蔹蔡蔟蔺");
        sb.append("戬蕖蔻蓿斡鹕嘏蓼榧槚槛榻榫槜榭槔槁槟槠榷榍僰酽酾酲酶酴酹厮碶碡碣碲磋碹碥劂臧豨殡霆霁辗蜚裴翡龇龈睿夥");
        sb.append("瞅瞍睽嘞嘈嘌嘎暧暝踌踉跽蜞蜥蜮蜾蝈蜴蜱蜩蜷蜿螂蜢嘘嘡鹗嘣嘤嘚嘛嗾嘧罴罱嶂幛赙罂骷骶鹘锲锴锶锷锸锽锾锵");
        sb.append("锿镁镂镃镄镅犒箐箦箧箸箨箬箅箪箔箜箢箓毓僖儆僳僭僬劁僦僮魅魃魆睾艋鄱膈膑鲑鲔鲙鲚鲛鲟獐獍飗觫雒夤馑銮");
        sb.append("塾麽廙瘌瘗瘊瘥瘘瘙廖韶旖膂阚鄯鲞粼粽糁槊鹚熘煽熥潢潆潇漤漕滹漯漶潋潴漪漉漳澉潍慵搴窬窨窭寤肇綮谮褡褙");
        sb.append("褓褛褊禚谯谰谲暨屣鹛嫣嫱嫖嫦嫚嫘嫜嫪鼐翟瞀鹜骠缥缦缧骢缪缫耦耧瑾璜璀璎璁璋璇璆奭髯髫撷撅赭墦撸鋆撙撺");
        sb.append("墀聩觐鞑蕙鞒蕈蕨蕤蕞蕺瞢劐蕃蕲蕰赜鼒槿樯槭樗樘槲鹝醌醅靥魇餍磊磔磙磉殣慭霄霈辘龉龊觑瞌瞑嘻嘭噎噶颙暹");
        sb.append("踔踝踟踬踮踣踯踺踞蝽蝾蝻蝰蝮螋蝓蝣蝼蝤噗嘬颚噍噢噙噜噌噀噔颛幞幡嶓嶙嶝骺骼骸镆镈镉镋镌镍镎镏镑镒镓镔");
        sb.append("稷箴篑篁篌篆牖儇儋徵磐虢鹞鹟滕鲠鲡鲢鲣鲥鲦鲧鲩鲪鲬橥獗獠觯鹠馓馔麾廛瘛瘼瘢瘠齑鹡羯羰糇遴糌糍糈糅翦鹣");
        sb.append("熜熵熠澍澌潵潸鲨潲鋈潟潼潽潺潏憬憧寮窳谳褴褫禤谵熨屦勰戮蝥缬缮缯骣畿耩耨耪璞璟靛璠璘聱螯髻髭髹擀熹甏");
        sb.append("擐擞磬鄹颞蕻鞘黇颟薤薨檠薏蕹薮薜薅樾橛橇樵檎橹橦樽樨橼墼橐翮醛醐醍醚醑觱磺磲赝飙殪霖霏霓錾辚臻遽氅瞟");
        sb.append("瞠瞰嚄嚆噤暾曈蹀蹅踶踹踵踽蹉蹁螨蟒螈螅螭螗螠噱噬噫噻噼幪罹圜镖镗镘镚镛镝镞镠氇氆憩穑穄篝篚篥簉篦篪盥");
        sb.append("劓翱魉魈徼歙盦膪螣膦膙鲭鲮鲯鲰鲱鲲鲳鲴鲵鲷鲺鲹鲻獴獭獬邂憝亸鹧廨赟癀瘭瘰廪瘿瘵瘴癃瘳斓麇麈嬴壅羲糗瞥");
        sb.append("甑燠燔燧燊燏濑濉潞澧澴澹澥澶濂澼憷黉褰寰窸褶禧嬖犟隰嬗鹨翯颡缱缲缳璨璩璐璪螫擤觳罄擢藉薹鞡薷薰藓藁檑");
        sb.append("檄懋醢翳繄礅磴鹩龋龌豳壑黻瞵瞩嚏嚅蹑蹒蹊蹓蹐螬螵疃螳蟑嚓羁罽罾嶷黜黝髁髀镡镢镤镥镦镧镨镩镪镫罅黏簧簌");
        sb.append("篾簃篼簏簖簋鼢黛鹪鼾皤魍艚龠繇貘邈貔臌膻臁臆臃鲼鲽鲾鳀鳁鳂鳃鳅鳆鳇鳈鳉鳊獯螽燮鹫襄縻膺癍麋馘懑濡濮濞");
        sb.append("濠濯蹇謇邃襕襁檗甓擘孺隳嬷蟊鹬鍪鏊鳌鬹鬈鬃瞽鞯鞨鞫鞧鞣藜藠藩鹲檫檵醪蹙礞礓礌燹餮蹩瞿曛颢曜躇鹭蹢蹜蟛");
        sb.append("蟪蟠蟮嚚鹮黠黟髅髂镬镭镯镱馥簠簟簪簦鼫鼬鼩雠艟臑鳎鳏鳐鳑鹱癔癜癖糨冁瀍瀌鎏懵彝邋鬏攉鞲鞴藿蘧蘅麓醭醮");
        sb.append("醯礤酃霪霭黼曝嚯蹰蹶蹽蹼蹯蹴蹾蹿蠖蠓蠋蟾蠊巅黢髋髌镲籀籁鳘齁魑艨鼗鳓鳔鳕鳗鳙鳚麒鏖蠃羸瀚瀣瀛襦谶襞骥");
        sb.append("缵瓒馨蘩蘖蘘醵醴霰颥酆矍曦躅鼍巉黩黥镳镴黧纂鼯犨臜鳜鳝鳟獾瀹瀵孀骧耰瓘鼙醺礴礳颦曩黯鼱鳡鳢癫麝赣夔爝");
        sb.append("灏禳鐾羼蠡耲耱懿韂鹳糵蘼霾氍饕躔躐髑镵穰鳤饔鬻鬟趱攫攥颧躜鼹鼷癯麟蠲蠹醾躞衢鑫灞襻纛鬣攮囔馕戆蠼爨齉");
        return sb.toString();
    }

    /**
     * 返回随机汉字
     * 
     * @param size 需要返回的字符串长度
     * @return 返回的随机汉字
     * @version 1.0
     */
    public static String random(int size) {
        final String wordHoneycomb = word4096();
        int wordLength = wordHoneycomb.length();
        Random random = new Random();
        StringBuilder sb = new StringBuilder();
        for (int i = 0; i < size; i++) {
            int randomIndex = random.nextInt(wordLength);
            String randomSimple = wordHoneycomb.substring(randomIndex, randomIndex + 1);
            sb.append(randomSimple);
        }
        return sb.toString();
    }

    /**
     * 获取汉字的笔画总数
     * 
     * @param str 原始汉字
     * @return 汉字的笔画数
     * @version 1.0
     */
    public static int stroke(String str) {
        if (str == null || "".equals(str)) {
            return -1;
        }
        int[] indexs = { 0, 2, 23, 82, 218, 419, 765, 1310, 2000, 2785, 3546, 4273, 4952, 5501, 5913, 6245, 6521, 6706,
                6796, 6877, 6924, 6952, 6974, 6986, 6994, 7000, 7001, 7002, 9999 };
        String first = str.substring(0, 1);
        final String wordHoneycomb = stroke();
        int index = wordHoneycomb.indexOf(first);
        for (int i = 0; i < indexs.length; i++) {
            if (indexs[i] > index) {
                return i;
            }
        }
        return -1;
    }

    /**
     * 原始汉字
     * 
     * @param str 获取拼音首字母
     * @return 返回的拼音
     * @version 1.0
     */
    public static String pinyinFirst(String str) {
        if (str == null || "".equals(str)) {
            return null;
        }
        int[] indexs = { 0, 69, 394, 828, 1165, 1213, 1426, 1730, 2074, 2621, 2823, 3317, 3607, 3765, 3779, 4010, 4343,
                4446, 4912, 5199, 5413, 5831, 6442, 9999 };
        String first = str.substring(0, 1);
        final String wordHoneycomb = pinyin();
        int index = wordHoneycomb.indexOf(first);
        final String alphabet = "-abcdefghjklmnopqrstwxyz";
        for (int i = 0; i < indexs.length; i++) {
            if (indexs[i] > index) {
                return alphabet.substring(i, i + 1);
            }
        }
        return null;
    }

    /**
     * 获取汉字的频率级别
     * 
     * @param str 原始汉字
     * @return 获取的频率级别
     * @version 1.0
     */
    public static int frequency(String str) {
        if (str == null || "".equals(str)) {
            return -1;
        }
        final String wordHoneycomb = frequency();
        String first = str.substring(0, 1);
        int index = wordHoneycomb.indexOf(first);
        if (index == -1) {
            return 3;
        } else if (index < 2500) {
            return 0;
        } else if (index < 3500) {
            return 1;
        } else if (index < 7000) {
            return 2;
        } else {
            return 4;
        }
    }

    /**
     * 是否为GBK一级汉字编码
     * 
     * @param str 原始汉字
     * @return 是否为GBK一级汉字编码
     * @version 1.0
     */
    public static boolean isLevelOne(String str) {
        if (str.compareTo("b0a1") >= 0 && str.compareTo("d7f9") <= 0) {
            return true;
        }
        return false;
    }

    /**
     * 单姓枚举表
     * 
     * @return 单姓枚举表
     * @version 1.0
     */
    public static String simpleFamilyName() {
        StringBuilder sb = new StringBuilder();
        sb.append("赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷");
        sb.append("罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄程穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁");
        sb.append("钟徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚和嵇邢滑裴陆荣翁荀羊於惠甄麴家封芮羿储靳汲邴糜松井段富巫乌焦");
        sb.append("巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙池乔阴郁胥能苍双闻莘党翟谭贡劳逄");
        sb.append("姬申扶堵冉宰郦雍舄璩桑桂濮牛寿通边扈燕冀郏浦尚农温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庾终暨居衡步都耿满弘匡国文寇广禄阙东殴殳沃利蔚越夔隆师巩");
        sb.append("厍聂晁勾敖融冷訾辛阚那简饶空曾毋沙乜养鞠须丰巢关蒯相查後荆红游竺权逯盖益桓公仉督晋楚闫法汝鄢涂钦归海岳帅缑亢况后有琴商牟佘佴伯赏墨哈谯笪年爱阳佟言福");
        return sb.toString();
    }

    /**
     * 复姓枚举表
     * 
     * @return 复姓枚举表
     * @version 1.0
     */
    public static String doubleFamilyName() {
        StringBuilder sb = new StringBuilder();
        sb.append("万俟司马上官欧阳夏侯诸葛闻人东方赫连皇甫尉迟公羊澹台公冶宗政濮阳淳于单于太叔申屠公孙仲孙轩辕令狐钟离宇文长孙慕容鲜于闾丘");
        sb.append("司徒司空亓官司寇子车颛孙端木巫马公西漆雕乐正壤驷公良拓跋夹谷宰父谷梁段干百里东郭南门呼延羊舌微生梁丘左丘东门西门南宫第五");
        return sb.toString();
    }

    /**
     * 生成随机的姓氏
     * 
     * @return 生成的姓氏
     * @version 1.0
     */
    public static String randomFamilyName() {
        final String simpleFamilyName = simpleFamilyName();
        final String doubleFamilyName = doubleFamilyName();
        int threshold = 5;
        int thresholdRange = 100;
        Random random = new Random();
        int simpleFamilyNameLength = simpleFamilyName.length();
        int doubleFamilyNameLength = doubleFamilyName.length();
        int probability = random.nextInt(thresholdRange);
        if (probability > threshold) {
            int index = random.nextInt(simpleFamilyNameLength);
            String word = simpleFamilyName.substring(index, index + 1);
            return word;
        } else {
            int index = random.nextInt(doubleFamilyNameLength / 2);
            String word = doubleFamilyName.substring(index * 2, index * 2 + 2);
            return word;
        }
    }
}
